[{"data": [{"description": "Fellow UBC Economics Students! The Vancouver School of Economics Undergraduate Society is proud to present to you its first ever: ECON WEEK! \n\nTo kick off the second term right, VSEUS has prepared a full week of fun events to promote the grand-opening of the Iona Building and showcase the opportunities we provide for Economic students at UBC. Come out and chill with the VSEUS Council for FREE EVENTS, FREE STUFF, and FREE FOOD. It is a week you do NOT want to miss! \n\n---------------------------------------------------------------------------------------------\n\nJanuary 11th - MAXIMIZE SURPLUS MONDAY\n\nJoin us for the grand opening of the Iona Building at our housewarming event with FREE TIM HORTONS DOUGHNUTS AND COFFEE to get you started for the day! We will also conduct tours throughout the day to give you the opportunity to look around and learn more about this wonderful building. \n\nLOCATION: Iona Building \nTIME: 9am-3pm\n---------------------------------------------------------------------------------------------\n\nJanuary 12th - MONOPOLY TUESDAY\n\nCome over to the main lobby and write some housewarming messages or your goals for the upcoming year on our Iona Appreciation Board. We will also have a VESUS Wishlist Board to let you write on what you expect from US this term. We would love to hear your input!\n\nLater in the night we will have a Monopoly board games night up in our new lounges! Bring all your friends and join us in this fun event! PRIZES will be given to winners. Food and refreshments will be provided.\n\nLOCATION: Iona Building (Undergrad Lounge) \nTIME: 10am-3pm; 6pm-8pm\n---------------------------------------------------------------------------------------------\n\nJanuary 13th - OLIGOPOLY WEDNESDAY\n\n\nWant to get involved and learn more about VSEUS and other Economics club? Then this is the day for you! Visit us at our clubs exhibition where we will showcase student involvement opportunities here in the Vancouver School of Economics. \n\nList of following organizations/clubs:\n•\tVancouver School of Economics Undergraduate Society (VSEUS)\n•\tECON Club\n•\tIONA Journal of Economics\n•\tECON Cafe\n•\tInternational Economics Business Association (IEBA)\n\nLOCATION: Iona Building \nTIME: 9am - 4pm \n\n---------------------------------------------------------------------------------------------\n\nJanuary 14th - MARGINAL BENEFIT THURSDAY\n\nThinking about applying to a graduate program? Prepare for the future and check out our informative Graduate School Information Session Night. With many presenters and falculty representatives, they will provide you with tips and techniques regarding applications and reference letters. Food and refreshments will be included. \n\nLOCATION: Irving K Barber Library (Dodson Room, Chapman Learning Commons) \nTIME: 6pm - 7:30pm\n\nEvent page:\nhttps://www.facebook.com/events/665955986840708/\n---------------------------------------------------------------------------------------------\n\nJanuary 15th - OPPORTUNITY COST FRIDAY (19+)\n\nJoin us for a toast with the great company of your VSEUS Council and fellow classmates! We inivte you to come and have a couple of beers at The Wolf and Hound Irish Pub in celebration of a wonderful week. DRINKS WILL BE ON US! \n\nLOCATION: Wolf and Hound Irish Pub \nTIME: 7pm-10pm\n\nEvent page: https://www.facebook.com/events/1503517166621954/\n---------------------------------------------------------------------------------------------", "start_time": "2016-01-11T00:00:00-0800", "end_time": "2016-01-15T23:59:00-0800", "name": "VSEUS Presents: ECON WEEK 2016", "place": {"name": "UBC Vancouver School of Economics Undergraduate Society", "location": {"city": "Vancouver", "country": "Canada", "latitude": 49.2710558, "longitude": -123.2504111, "state": "BC", "street": "035 Iona, 6000 Iona Drive", "zip": "V6T 1L4"}, "id": "276923702337235"}, "id": "1061948563850567", "owner": {"name": "UBC Vancouver School of Economics Undergraduate Society", "id": "276923702337235"}}, {"description": "Interested in learning about opportunities to work in the field of sustainability? There are more options than you think! \n\nThe event will feature 6 different professionals whose work relates to social, environmental, and economic sustainability. You'll hear about their background and career path, as well as have a chance to network and talk with them one-on-one.\n\nOur guest speakers include professionals from the public, private, and non-profit sectors, from early-career professionals to those who have been in their roles for a bit longer. \n\n- Viren Malik, COO at Ethical Bean Coffee\n- Kyle Empringham, Public Engagement Specialist at David    \n    Suzuki Foundation\t\n- Jeremy Moorhouse, Senior Analyst at Clean Energy Canada\t\n- Maggie Baynham, Sustainability Coordinator at City of Surrey\t\n- Joey Liu, Community Development Coordinator at The World    \n    In A Garden\n- Christopher Correia, Planning Analyst at Pacific Land Group\n\nRefreshments will be provided.\n\nThis event was jointly organized by Common Energy (UBC) and Embark (SFU).", "start_time": "2016-01-28T18:30:00-0800", "end_time": "2016-01-28T20:00:00-0800", "name": "Sustainability Careers Night - Hosted by Embark SFU & Common Energy", "place": {"name": "CityStudio Vancouver", "location": {"city": "Vancouver", "country": "Canada", "latitude": 49.27031, "longitude": -123.11489, "state": "BC", "street": "1800 Spyglass Place"}, "id": "139777326102573"}, "id": "1536152013343775", "owner": {"name": "Common Energy UBC", "id": "131176050310201"}}, {"description": "Euthanasia is a highly contentious issue and laws regarding voluntary and involuntary assisted suicide vary in different countries. Come join Friends of MSF in debating whether doctor-assisted suicide is justified. You will be split up into three teams, portraying an individual with their own perspective on the matter, including: a doctor, family member, and pro-life figure. After reading our case study with the rest of your team, you will present your opinion and will challenge other teams. Entry is free and refreshments will be provided.\n\nLink to sign up for debate:\nhttps://docs.google.com/forms/d/1HXFWXc6EvnPNFPokpntkqIdJB8_Dkk9_rKt5uRSKMIc/viewform", "start_time": "2016-01-25T17:30:00-0800", "end_time": "2016-01-25T19:00:00-0800", "name": "FoMSF Presents: Is Doctor-Assisted Suicide Justified?", "place": {"name": "Irving K. Barber Learning Centre #261"}, "id": "558305877678503", "owner": {"name": "Friends of Médecins Sans Frontières UBC", "id": "130947100346473"}}, {"description": "Can't make it ( or can't wait!) to our LDC Welcome Back Party: RED Edition? Want to learn more about this term's classes? Have nothing to do and want free snacks and drinks? Like pre-parties? Come hang out with us before the party starts! \n\nWhether you are a past student or are interested in taking classes with us this term, this event is aimed at connecting/reconnecting you with fellow LDCers and executives! \nWe'll be answering questions about our classes and free week (LDC presents Free Week: January Edition), as well as playing some music for the event's entirety, so pop by whenever you're free to chat, socialize and/or dance!\n\nMore info coming up!", "start_time": "2016-01-22T16:00:00-0800", "end_time": "2016-01-22T18:00:00-0800", "name": "LDC Hangs Out", "place": {"name": "AMS Student Nest, Lev Bukhman Theatre Lounge"}, "id": "458225307719819", "owner": {"name": "UBC Latin Dance Club", "id": "516422108384275"}}, {"description": "Our third annual Humanities & Social Sciences Conference hopes to inspire you as students to think beyond conventional boundaries. By participating in academic research, you are not only adding to the world of scholarly knowledge, you are also contributing to a canon of thought that will propel us into the future. At its root, research seeks to pull from a variety of diverse sources in order to create unique ideas. In doing so, students have the power to play an active part in shaping the world around us.\n\nThe focus of this year's conference is on INNOVATION. We are therefore seeking to highlight the important place of undergraduate thought in this evolutionary process.\nOur conference aims to do this by providing a platform for students from all levels of undergraduate study to present their work, allowing them to enter into scholastic dialogue both with their peers, who are actively involved in this evolution, and with professors, who have previously been through this process themselves, and who are ensuring that it continues to take place in current students.\n\nAttendance is free and includes complimentary lunch, refreshments, and prize raffle entry. Register at this link to attend: https://www.eventbrite.ca/e/aus-humanities-social-sciences-conference-innovation-tickets-19670470908\n\nCRITERIA FOR SUBMISSIONS:\nWe are accepting submissions as of NOVEMBER 16, 2015 - DECEMBER 16, 2015. \n\nWe welcome submissions of presentation proposals from all universities and colleges in BC. Students may present work done as term papers, honours theses, or independent research projects; works in progress may also be eligible. Presentations should be no longer than 15 minutes, in English, and should represent work done while the presenter was an undergraduate student. The deadline for submissions is December 16th, 2015.\n\nThis year we have extended our submissions to include the work of Fine Arts students. Submissions can be 2D or 3D art pieces. Canvases may not be smaller than 12’ X 12” and no larger than 36” X 48”.\n\nFor more information: \nhttp://aus.arts.ubc.ca/events/conference/\nOR send us an email on: \naus.conference@gmail.com\n\n#thisisyourhAUS #12000strong", "start_time": "2016-01-16T10:30:00-0800", "end_time": "2016-01-16T17:30:00-0800", "name": "The AUS Presents: The AUS Humanities & Social Sciences Conference", "place": {"name": "AMS Student Nest", "location": {"city": "Vancouver", "country": "Canada", "latitude": 49.266485668, "longitude": -123.24990050775, "state": "BC", "street": "6133 University Boulevard", "zip": "V6T 1Z1"}, "id": "1650598338487394"}, "id": "1639893986258522", "owner": {"name": "UBC Arts Undergraduate Society", "id": "107744622618307"}}, {"description": "Hello Arts students of UBC! Get ready, get pumped, and get some Arts pride!\n\nThe second term of the school year is approaching (already?!), and that means it is time for the Arts Undergraduate Society to present you its annual Arts Week!\n\n❖❖❖❖❖❖❖❖❖❖❖❖❖❖❖❖❖❖❖❖❖❖❖❖❖❖❖❖❖❖❖❖❖❖❖❖❖❖❖\n\nWHAT IS ARTS WEEK?\nArts Week is a full week of events dedicated for creating Arts pride, community, and happiness! The events this week range from informative, healthful, and loads of fun! \n\nWHEN IS ARTS WEEK?\nArts Week takes place the second week after the Winter Break, from January 11 to 16!\n\nWHAT ARE THE EVENTS?\n—Monday, Jan 11—\n❖Clubs In the Sub\n❖Pancake Breakfast @9-11am in the Nest \n❖Trivia at The Pit @8pm\n\n—Tuesday, Jan 12:—\n❖Free Coffee & Hot Chocolate: Mural Unveiling @11-1pm in MASS\n❖Wine and Cheese: http://on.fb.me/1S0iIUH \n\n—Wednesday, Jan 13—\n❖Wellness Fair @12-3:30pm\n❖Pop Up Ping Pong @11-1pm\n❖Zumba class: http://on.fb.me/1Jq1uxk \n\n—Thursday, Jan 14—\n❖Live Music & BBQ @11-2pm\n\n—Friday, Jan 15—\n❖Purple: Storm the Pit: http://on.fb.me/1MPIrHE\n❖The Calendar + AUS FYC Present Garbagé: http://on.fb.me/1R7UnfJ\n\n—Saturday, Jan 16—\n❖AUS Humanities & Social Sciences Conference: http://on.fb.me/1PcfNlU\n\n\nCONTESTS AND PRIZES?\nWe would love to see your AUSome pictures from Arts Week! For each event, we will be selecting one winner from Instagram to be awarded with 5 drink tickets for our Purple: Storm the Pit party! Use the hashtags #UBCArtsWeek2016 in your Arts Week post so you can be entered into our contest. Limit to one entry per event (the more events you attend, the higher your chance of winning!) \n\n\n❖❖❖❖❖❖❖❖❖❖❖❖❖❖❖❖❖❖❖❖❖❖❖❖❖❖❖❖❖❖❖❖❖❖❖❖❖❖❖\n\nWe’re looking forward to seeing you all there at this week for YOU! #12000strong #thisisyourhAUS", "start_time": "2016-01-11T00:00:00-0800", "end_time": "2016-01-16T21:50:00-0800", "name": "The AUS Presents: ARTS WEEK 2016", "place": {"name": "UBC Arts Undergraduate Society", "location": {"city": "Vancouver", "country": "Canada", "latitude": 49.268148333003, "longitude": -123.25420007774, "state": "BC", "street": "Buchanan D-140, 1866 Main Mall", "zip": "V6T 1Z1"}, "id": "107744622618307"}, "id": "556696841148520", "owner": {"name": "UBC Arts Undergraduate Society", "id": "107744622618307"}}, {"description": "Welcome to the first UBC Slam Poetry writing workshop of the semester! The workshops last semester were a success and I am very excited to keep on writing and performing with you. UBC Slam will run biweekly writing workshops where we will do writing exercises, performance exercises, and stage technique. These workshops will be every other Tuesday.\n\nWe have booked a room in the Student Nest for the workshop! I will see you at 1pm in room 2528.\n\nI am very excited for this workshop! If you have a piece you have been working on and want to workshop it, bring it with you and we will listen and give feedback!\n\nThank you,\nMariah Dear\n604-318-6587\n\n***UPDATE***\nThere will be free coffee at this workshop! Bring a mug to help out, but we will have a few paper cups available too!", "start_time": "2016-01-19T13:00:00-0800", "name": "UBC Slam Poetry: Writing Workshop #1 of 2016", "place": {"name": "AMS Student Nest", "location": {"city": "Vancouver", "country": "Canada", "latitude": 49.266485668, "longitude": -123.24990050775, "state": "BC", "street": "6133 University Boulevard", "zip": "V6T 1Z1"}, "id": "1650598338487394"}, "id": "1707242762852328", "owner": {"name": "UBC Slam Poetry", "id": "701309313253008"}}, {"description": "Our first big  event of 2016 is finally here. We'll be kicking off the first of four SOUL CRAVINGS meetings this week! \n\nAll of the sessions are led by students and will feature a variety of presentations, discussions, and videos that will try to engage you and ask you to consider some of these big questions and desires that we have in our lives.\n\nThe first topic that we'll be tackling is: Change in the World\n\nInterested? Curious? Just dropping by? Showing up for the free food (yes, free food!). All are welcome, see you there!", "start_time": "2016-01-21T17:00:00-0800", "end_time": "2016-01-21T19:00:00-0800", "name": "Soul Cravings: Session 1", "place": {"name": "UBC NEST Lev Bukhman Theatre Lounge"}, "id": "1266931630000240", "owner": {"name": "UBC Power to Change", "id": "276462869034451"}}, {"description": "The Mentorship Program is the biggest and probably most important aspect of our club. First year CSP students who are members of our club have the unique and enriching opporutnity to be paired with an alumni CSP student as their mentor. A mentor would guide you through the process of discovering specialization options, summer school courses, volunteer opportunities, extracurricular activities, and many many more. \n________________________________________________\n\nMentorship Night is the perfect time and place to meet mentors and mingle with some alumni CSP students who have been through exactly what you are going through!\n\nYou can also purchase your $2 (only) club membership at this event!!! Members benefit from having an assigned mentor, free access to events hosted by our club and free food/stuff here and there. \n\nCOME OUT AND HAVE SOME FUN WITH US!\n- EAT FOOD\n- PLAY GAMES & ACTIVITIES\n- ASK QUESTIONS\n- GET YOUR MEMBERSHIP\n- MINGLE (before the first wave of midterms hit!)\n\nMembers and Non-members: FREE \n(Only this event will be free for everyone!)\n_______________________________________________\n\nSTAY TUNED for fun facts about the mentors you will be meeting!\n\nQuestions: csp.mentorshipclub@gmail.com", "start_time": "2016-01-26T16:00:00-0800", "end_time": "2016-01-26T19:00:00-0800", "name": "CMC MENTORSHIP NIGHT", "place": {"name": "Abdul Ladha Science Student Centre", "location": {"city": "Vancouver", "country": "Canada", "latitude": 49.2661219, "longitude": -123.2510003, "state": "BC", "street": "2055 East Mall", "zip": "V6T 1W5"}, "id": "152819448084339"}, "id": "1675255416065093", "owner": {"name": "CSP Mentorship Club", "id": "542030372619657"}}, {"description": "Beef and Pizza is one of the larger academic events the ECE Student Society holds. The society invites both ECE students and professors to a meeting, where students can talk to profs about concerns they have with the curriculum, as well as receiving free pizza.\n*****************************************************************\nLocation: Kaiser 2020/2030\n\nDate: Jan. 27 Wed. 12-1:30pm\n\nWe encourage you to submit your questions and feedback (both positive and negative) ahead of time. Please fill out the following form. If you are not able to attend in person, we can ask the panel of instructors on your behalf.\nhttp://goo.gl/forms/vEZQHNDSs6\n*****************************************************************\nAttending:\nProfessor Konstantin Beznosov (12:30)\nProfessor Farshid Agharebparast\nProfessor Andre Ivanov\n.......\nmore to come!", "start_time": "2016-01-27T12:00:00-0800", "name": "[ECESS] Beef and Pizza", "place": {"name": "Kaiser Building UBC", "location": {"city": "Vancouver", "country": "Canada", "latitude": 49.262059771566, "longitude": -123.25009180478, "state": "BC"}, "id": "159390144087566"}, "id": "1172887396072767", "owner": {"name": "UBC Electrical & Computer Engineering Student Society (ECESS)", "id": "359994484090375"}}, {"description": "Are you interested in making a difference in someone’s life? Do you want to give back to society? Do you like FREE FOOD?\nIf so, come out and save lives by wearing green and DONATE BLOOD during Kin Week in the ballroom at Totem Park Residences from 11:00am to 2:00pm.\n\nAfter you donate there will be a FREE BBQ at OSBORNE!!! Come and endulge in some burgers and hot dogs after you give back or if you can't donate just stop by for FREE FOOD.\nBLEED GREEN!\n\n*Appointments can be booked at blood.ca/donate or call 1-888-2-DONATE*\nSpaces are filling up so book your time asap!\nDrop-ins will also be welcome at the clinic, however space is limited and there is no guarantee that there will be a space available at your desired time.\n**FAQS**\nAm I eligible? \nhttps://www.blood.ca/en/blood/abcs-eligibility and https://www.blood.ca/en/eligibility-quiz\nHow does the donation work?https://www.blood.ca/en/blood/how-donation-works\n\nHope to see you all there!\nxoxo \nKUS Execs", "start_time": "2016-01-21T11:00:00-0800", "end_time": "2016-01-21T14:00:00-0800", "name": "KIN WEEK 2016: KINtribute to a Life", "place": {"name": "UBC Life Science Building", "location": {"city": "Vancouver", "country": "Canada", "latitude": 49.262411546792, "longitude": -123.24516588404, "state": "BC", "zip": "V6T"}, "id": "229775430431256"}, "id": "500894633425290", "owner": {"name": "UBC Kinesiology Undergraduate Society - KUS", "id": "180718128655354"}}], key: "January" }]
