[{"description": "You are cordially invited to join us on April 1, 2016 for an exciting evening of Art Historical discussion and critical reflection. The symposium comprises the presentation and discussion of a range of undergraduate research treating on contemporary and historical issues. This year's topics examine various art historical discourses, including: the amplification of brand value through imaging; the exploration of technophobia and transphobia assisted by advances in biotechnology, through the lens of the “The Cyborg Manifesto;” and, finally, the expression of national identity through the principle of “one in the all (wanwu guiyi)” that is firmly associated with history, society and Chinese culture. Each presentation will be followed by a conversation period during which all students and faculty are encouraged to voice questions and comments. Refreshments will be provided during intermission and final reception.\n \nThe Undergraduate Journal of Art History and Visual Culture (UJAH) will launch their 7th issue at the symposium. This publication features the exceptional body of research, art, and writing taking place in all undergraduate art disciplines at UBC, as well as the abstracts of this year’s symposium papers.\n \n3:00PM – Introduction\n \nBlake Finucane, #Branded: Christie’s in the Age of Digital Image Circulation\n \nRan Zheng, To Move The Mountain: The Image Of Collectivity In Chinese Contemporary Art\n \n4:00-4:10PM – Intermission\n \nLucas Kling, The Cyborg Complex: Technophobia, Transphobia, and American Reflexxx \n \n5:00PM – Reception \n \nUBC Art History Students’ Association\nEmail: ubcahsa@gmail.com\nFacebook: Facebook.com/UBCAHSA\nwww.ahva.ubc.ca", "start_time": "2016-04-01T15:00:00-0700", "end_time": "2016-04-01T18:30:00-0700", "name": "12th Annual Art History Undergraduate Symposium & UJAH Issue 7 Launch", "place": {"name": "Audain Art Centre", "location": {"city": "Vancouver", "country": "Canada", "latitude": 49.2638682, "longitude": -123.2547265, "state": "BC", "street": "6398 University Avenue"}, "id": "1405143836412956"}, "id": "1705623736372198", "owner": {"name": "UBC Art History, Visual Art and Theory", "id": "111982666071"}}, {"description": "Ever had a conversation that sounded like this?\n\n“ Alpha: Dude you look tired.\n. Beta: I’ve been mugging for days ”\n \nFeeling like a dazed Beta?  No fear, SSA is here! Put on your most comfortable clothes (promise we won’t judge) and join us on Mondays & Wednesdays for some serious knowledge gains. Take regular study breaks with us to destress; detox but don’t degenerate! We’ll help you keep those motivation levels up with FREE FOOD AND DRINKS, friends and fun! Jk please study.\n\n\nNew team, New name, Same study feels. SSA is back and ready to mug! See you there!\n\nSTUDY DATES & TIMES\nDate: April 11th, 13th, 18th, 20th\nVenue: HA 343 (Sauder building)\nTime: 9AM - 10PM\n\n*UPDATE*\nHA 343 is also available on the following days. Feel free to use it for studying; please note, however, that snacks will not be provided on these dates.\n\nDate: April 15th/22nd/17th/24th \nVenue: HA 343  (Sauder building)\nTime:  9AM -10PM", "start_time": "2016-04-11T10:00:00-0700", "end_time": "2016-04-11T22:00:00-0700", "name": "SSA Finals Fuhhdaze", "place": {"name": "HA 343 (Sauder building)"}, "id": "1702811683326903", "owner": {"name": "UBC Singapore Students' Association", "id": "880262285394994"}}, {"description": "UBC Club Mech would like to invite you to our Networking 101 Workshop. This is a free event for all UBC Engineering students. \n\nDate: Thursday, March 31st 2016 \nTime: 6pm-8:30pm (sign in at 5:30)\nLocation: Engineering Student Centre (ESC) \nMax. Capacity: 200 \nFood & beverages provided\n\nWe will be graced by the president of Vancouver’s Social Butterfly Club, Alice Zhou,  who will be giving a 2-hour presentation and interactive workshop on networking. Alice is an established event producer and publicist in Vancouver with over 6000 professional contacts in her network and is known as Vancouver's Networking Queen. \n\nAlice’s interactive workshop will cover the following networking topics:\n How to prepare before networking\n What to do during a networking event\n Tools of the trade\n When and how to best follow up with a networking contact\n Who should you network with?\n How to turn networking into getting a job or promotion\n\nBring/prepare a business card design (can be paper-printed design or an actual card), have a set-up LinkedIn profile, and dress in business casual/formal attire – as if you are actually attending a real networking event. \n\nRSVP HERE: http://goo.gl/forms/z6PCWSvvoQ \nRSVP LATEST BY WEDNESDAY, MARCH 30!\n\nWe hope to see you there!", "start_time": "2016-03-31T18:00:00-0700", "end_time": "2016-03-31T21:00:00-0700", "name": "Networking 101 Workshop", "place": {"name": "UBC Engineering Student Centre", "location": {"city": "Vancouver", "country": "Canada", "latitude": 49.2538414, "longitude": -123.2348099, "state": "BC", "street": "2335 Engineering Lane", "zip": "V6T1Z4"}, "id": "186387364719842"}, "id": "1654283971490585", "owner": {"name": "UBC Club Mech", "id": "100699010041708"}}, {"description": "Feeling lAUSt in Arts? Not sure what you're going to do with your BA? \nFear no more! Let AUS be your compass! \n\nAUS FYC is excited to present \"Beyond the BA\", a career conference that will guide you, as a first year student, to your future. Bringing in Alumni from all major faculties, BtBA will take you on a journey of all the post BA possibilities.\nBtBA hopes to inspire first years by presenting them with the opportunity to see how life is beyond the BA. Alumni from all ages will be speaking on their lives and jobs, and the opportunities that their UBC degree has given them post-graduation. This wide range of speakers will provide you with a timeline of how a Bachelors of Arts can assist you. \n\n---------------\n\nFor no cost at all, this conference will include:\n- Complimentary lunch from Scent of a Sandwich \n- Refreshments\n- Amazing networking opportunities!\n\n---------------\n\nREGISTER NOW FOR FREE! We have a limited amount of spots, so hop on them quick! Sign up here:\nhttp://goo.gl/forms/zGShvfcJO9\n---------------\nDress code: Business casual.\n--------------\n10:30 AM Registration \n-----------------\n11:00 AM Opening Ceremony | Keynote\n11:45 AM Session 1\n12:15 PM Session 2 \n-----------------\n12:45 PM Lunch\n-----------------\n1:45 PM Session 3 \n2:20 PM Session 4 \n2:50 PM Keynotes | Closing Ceremony \n----------------\n3:30 PM End\n-------------------------------------------------------------------------------------\n\n\n#getlAUSt #BeFound\n#12000strong #thisisyourhAUS", "start_time": "2016-04-02T10:30:00-0700", "end_time": "2016-04-02T15:35:00-0700", "name": "The AUS FYC Presents: Beyond the BA Conference", "place": {"name": "Buchanan A", "location": {"city": "Vancouver", "country": "Canada", "latitude": 49.268391936931, "located_in": "16761458703", "longitude": -123.25481385686, "state": "BC", "street": "1866 Main Mall", "zip": "V6T 1Z1"}, "id": "152668228098860"}, "id": "716563411814137", "owner": {"name": "UBC Arts Undergraduate Society", "id": "107744622618307"}}, {"description": "The ECESS is hosting its final Games Night of the semester! \nTake a break from studying and project work, grab your friends and come join us! \n\nThere will be, as usual, FREE PIZZA, GAMES & AWESOME PRIZES!\n\nThink you've got mad skills at FIFA, Foosball, NHL, Pool, or Smash Bros.? Put them to the test and enter our tournaments. Not a fan of competition? Don't worry, we have other games to play. \n\n★TOURNAMENTS!★\n\nPool:\n           Sign Up Here:  http://goo.gl/forms/bcKTirTXFW\n\nNHL:\n           Sign Up Here:  http://goo.gl/forms/fK3Ep1l3is\n\nFIFA:\n           Sign Up Here:  http://goo.gl/forms/yviQitqBbS\n\nSmash Bros. Melee\n           Sign Up Here:  http://goo.gl/forms/hxJMAOQSWV\n\nFoosball:\n           Sign Up Here:  http://goo.gl/forms/2JZaWsr6VT\n\n★VIDEO GAMES★\n\nStreet Fighter V\nHalo\nMario Kart \nMario Party\n\n★BOARD GAMES★\n\nResistance\nCoup\nSkull\nSaboteur\nBetrayal at House on the Hill\nand More\n\n★CARD GAMES★\n\nPoker\nBlackjack\nSpoons (or Knives if you prefer)\nand More", "start_time": "2016-04-01T17:00:00-0700", "end_time": "2016-04-01T21:00:00-0700", "name": "ECESS Games Night", "place": {"name": "MCLD 434"}, "id": "177483775972056", "owner": {"name": "UBC Electrical & Computer Engineering Student Society (ECESS)", "id": "359994484090375"}}, {"description": "The African Business Club presents its third social event this semester! Hosted by the Infrastructure and Entrepreneurship Directors, this event’s objective is to spark discussion around Africa’s opportunity to leapfrog in diverse technological and entrepreneurial avenues: with innovations ranging from widespread mobile connectivity and clean energy to technology-enabled healthcare and education systems. The event will start with a TEDx talk by Mark Essien (Nigerian tech entrepreneur), which will serve as a foundation for discussion and debate.\n\nThis is a free event and a great chance to relax after a long  Monday with friends and some great company from the African Business Club team! If you are looking to have a great time with food, good company and an engaging discussion on topics of global importance, this event is for you!\n\n Let us entertain you on Monday evening! Looking forward to seeing you at the Global Lounge. \n\nSome of the topics to be discussed are founded on these questions : \n\nThe West has thrived on the development of transformative technology, some of which have become older legacy systems: Should Africa bypass those legacy systems and instead use current technology and innovative techniques to leapfrog the West?\nShould Africans take the lead on renewable energy? Why? Why not?\n\n Snacks and refreshments will also be available!\n\nThis event is free and open to everyone and also, \nFREE FOOD!", "start_time": "2016-04-04T18:00:00-0700", "end_time": "2016-04-04T20:00:00-0700", "name": "Reimagining Innovation in Africa: Leapfrogging the Rest of the World", "place": {"name": "UBC Global Lounge", "location": {"city": "Vancouver", "country": "Canada", "latitude": 49.2618133, "longitude": -123.2552552, "state": "BC", "street": "2205 Lower Mall, Building 1", "zip": "V6T 1Z4"}, "id": "225228720977110"}, "id": "1724433361177218", "owner": {"name": "UBC African Business Club", "id": "140962286236583"}}, {"description": "The very AMS that built the AMS Student Nest and hosts The 9th Annual AMS Block Party is hosting an open house to get you consulted, employed and on the winning end of some free block party tickets and/or gift cards! \n********************************************************************\n1) TELL US WHAT YOU THINK \nIn person - We're throwing our doors open for a literal open house this and welcoming students into the Nest for some focus groups on what to do with the former Perch space. Come by either session and be entered in a raffle to win two block party tickets! \n\nOpen house dates/times: Saturday April 2nd from 3:45-5:30PM and Thursday April 7th from 11AM-3PM \n\nOnline Survey - fill it out and win free things (~link coming at you real soon, check back tomorrow for more~)\n********************************************************************\n2) GET EMPLOYED\nhttp://www.ams.ubc.ca/jobs/employment/ \nWe're hiring for next year and all the jobs are posted at the link above - make sure you click the \"more job descriptions\" button to see all the options. Perks include year long pit guest list and lots of free coffee....", "start_time": "2016-04-02T12:00:00-0700", "end_time": "2016-04-08T12:00:00-0700", "name": "AMS Open House & Hiring", "place": {"name": "UBC Alma Mater Society - AMS", "location": {"city": "Vancouver", "country": "Canada", "latitude": 49.2686112, "longitude": -123.2503152, "state": "BC", "street": "AMS of UBC Vancouver 6133 University Boulevard", "zip": "V6T 1Z1"}, "id": "48978787993"}, "id": "1857250177835314", "owner": {"name": "UBC Alma Mater Society - AMS", "id": "48978787993"}}, {"description": "Do YOU like swimming? \nWant to meet some great people and get fit along the way?\n\nCome out to the Inaugral 2016 UBC Swim Club Kick Off Event for more info! There will be information on our programs, free food, a post info social at the Pit, and a draw prize for a free 2016/2017 membership!\n\nCheck out our page for more info on our club and give it a good ol thumbs up!\nhttps://www.facebook.com/swimclub.ubc/\n\nCan't wait to see you there!\n\n~UBC Swim Club Execs", "start_time": "2016-03-31T19:00:00-0700", "name": "UBC Swim Club Kick Off Night + Pit", "place": {"name": "Lev Bukhman Theatre Lounge (egg)"}, "id": "980722488687138", "owner": {"name": "AMS Swim Club at UBC", "id": "349037658553684"}}]