[{"data": [{"description": "Fellow UBC Economics Students! The Vancouver School of Economics Undergraduate Society is proud to present to you its first ever: ECON WEEK! \n\nTo kick off the second term right, VSEUS has prepared a full week of fun events to promote the grand-opening of the Iona Building and showcase the opportunities we provide for Economic students at UBC. Come out and chill with the VSEUS Council for FREE EVENTS, FREE STUFF, and FREE FOOD. It is a week you do NOT want to miss! \n\n---------------------------------------------------------------------------------------------\n\nJanuary 11th - MAXIMIZE SURPLUS MONDAY\n\nJoin us for the grand opening of the Iona Building at our housewarming event with FREE TIM HORTONS DOUGHNUTS AND COFFEE to get you started for the day! We will also conduct tours throughout the day to give you the opportunity to look around and learn more about this wonderful building. \n\nLOCATION: Iona Building \nTIME: 9am-3pm\n---------------------------------------------------------------------------------------------\n\nJanuary 12th - MONOPOLY TUESDAY\n\nCome over to the main lobby and write some housewarming messages or your goals for the upcoming year on our Iona Appreciation Board. We will also have a VESUS Wishlist Board to let you write on what you expect from US this term. We would love to hear your input!\n\nLater in the night we will have a Monopoly board games night up in our new lounges! Bring all your friends and join us in this fun event! PRIZES will be given to winners. Food and refreshments will be provided.\n\nLOCATION: Iona Building (Undergrad Lounge) \nTIME: 10am-3pm; 6pm-8pm\n---------------------------------------------------------------------------------------------\n\nJanuary 13th - OLIGOPOLY WEDNESDAY\n\n\nWant to get involved and learn more about VSEUS and other Economics club? Then this is the day for you! Visit us at our clubs exhibition where we will showcase student involvement opportunities here in the Vancouver School of Economics. \n\nList of following organizations/clubs:\n•\tVancouver School of Economics Undergraduate Society (VSEUS)\n•\tECON Club\n•\tIONA Journal of Economics\n•\tECON Cafe\n•\tInternational Economics Business Association (IEBA)\n\nLOCATION: Iona Building \nTIME: 9am - 4pm \n\n---------------------------------------------------------------------------------------------\n\nJanuary 14th - MARGINAL BENEFIT THURSDAY\n\nThinking about applying to a graduate program? Prepare for the future and check out our informative Graduate School Information Session Night. With many presenters and falculty representatives, they will provide you with tips and techniques regarding applications and reference letters. Food and refreshments will be included. \n\nLOCATION: Irving K Barber Library (Dodson Room, Chapman Learning Commons) \nTIME: 6pm - 7:30pm\n\nEvent page:\nhttps://www.facebook.com/events/665955986840708/\n---------------------------------------------------------------------------------------------\n\nJanuary 15th - OPPORTUNITY COST FRIDAY (19+)\n\nJoin us for a toast with the great company of your VSEUS Council and fellow classmates! We inivte you to come and have a couple of beers at The Wolf and Hound Irish Pub in celebration of a wonderful week. DRINKS WILL BE ON US! \n\nLOCATION: Wolf and Hound Irish Pub \nTIME: 7pm-10pm\n\nEvent page: https://www.facebook.com/events/1503517166621954/\n---------------------------------------------------------------------------------------------", "start_time": "2016-01-11T00:00:00-0800", "end_time": "2016-01-15T23:59:00-0800", "name": "VSEUS Presents: ECON WEEK 2016", "place": {"name": "UBC Vancouver School of Economics Undergraduate Society", "location": {"city": "Vancouver", "country": "Canada", "latitude": 49.2710558, "longitude": -123.2504111, "state": "BC", "street": "035 Iona, 6000 Iona Drive", "zip": "V6T 1L4"}, "id": "276923702337235"}, "id": "1061948563850567", "owner": {"name": "UBC Vancouver School of Economics Undergraduate Society", "id": "276923702337235"}}, {"description": "Interested in learning about opportunities to work in the field of sustainability? There are more options than you think! \n\nThe event will feature 6 different professionals whose work relates to social, environmental, and economic sustainability. You'll hear about their background and career path, as well as have a chance to network and talk with them one-on-one.\n\nOur guest speakers include professionals from the public, private, and non-profit sectors, from early-career professionals to those who have been in their roles for a bit longer. \n\n- Viren Malik, COO at Ethical Bean Coffee\n- Kyle Empringham, Public Engagement Specialist at David    \n    Suzuki Foundation\t\n- Jeremy Moorhouse, Senior Analyst at Clean Energy Canada\t\n- Maggie Baynham, Sustainability Coordinator at City of Surrey\t\n- Joey Liu, Community Development Coordinator at The World    \n    In A Garden\n- Christopher Correia, Planning Analyst at Pacific Land Group\n\nRefreshments will be provided.\n\nThis event was jointly organized by Common Energy (UBC) and Embark (SFU).", "start_time": "2016-01-28T18:30:00-0800", "end_time": "2016-01-28T20:00:00-0800", "name": "Sustainability Careers Night - Hosted by Embark SFU & Common Energy", "place": {"name": "CityStudio Vancouver", "location": {"city": "Vancouver", "country": "Canada", "latitude": 49.27031, "longitude": -123.11489, "state": "BC", "street": "1800 Spyglass Place"}, "id": "139777326102573"}, "id": "1536152013343775", "owner": {"name": "Common Energy UBC", "id": "131176050310201"}}, {"description": "Euthanasia is a highly contentious issue and laws regarding voluntary and involuntary assisted suicide vary in different countries. Come join Friends of MSF in debating whether doctor-assisted suicide is justified. You will be split up into three teams, portraying an individual with their own perspective on the matter, including: a doctor, family member, and pro-life figure. After reading our case study with the rest of your team, you will present your opinion and will challenge other teams. Entry is free and refreshments will be provided.\n\nLink to sign up for debate:\nhttps://docs.google.com/forms/d/1HXFWXc6EvnPNFPokpntkqIdJB8_Dkk9_rKt5uRSKMIc/viewform", "start_time": "2016-01-25T17:30:00-0800", "end_time": "2016-01-25T19:00:00-0800", "name": "FoMSF Presents: Is Doctor-Assisted Suicide Justified?", "place": {"name": "Irving K. Barber Learning Centre #261"}, "id": "558305877678503", "owner": {"name": "Friends of Médecins Sans Frontières UBC", "id": "130947100346473"}}, {"description": "Can't make it ( or can't wait!) to our LDC Welcome Back Party: RED Edition? Want to learn more about this term's classes? Have nothing to do and want free snacks and drinks? Like pre-parties? Come hang out with us before the party starts! \n\nWhether you are a past student or are interested in taking classes with us this term, this event is aimed at connecting/reconnecting you with fellow LDCers and executives! \nWe'll be answering questions about our classes and free week (LDC presents Free Week: January Edition), as well as playing some music for the event's entirety, so pop by whenever you're free to chat, socialize and/or dance!\n\nMore info coming up!", "start_time": "2016-01-22T16:00:00-0800", "end_time": "2016-01-22T18:00:00-0800", "name": "LDC Hangs Out", "place": {"name": "AMS Student Nest, Lev Bukhman Theatre Lounge"}, "id": "458225307719819", "owner": {"name": "UBC Latin Dance Club", "id": "516422108384275"}}, {"description": "Our third annual Humanities & Social Sciences Conference hopes to inspire you as students to think beyond conventional boundaries. By participating in academic research, you are not only adding to the world of scholarly knowledge, you are also contributing to a canon of thought that will propel us into the future. At its root, research seeks to pull from a variety of diverse sources in order to create unique ideas. In doing so, students have the power to play an active part in shaping the world around us.\n\nThe focus of this year's conference is on INNOVATION. We are therefore seeking to highlight the important place of undergraduate thought in this evolutionary process.\nOur conference aims to do this by providing a platform for students from all levels of undergraduate study to present their work, allowing them to enter into scholastic dialogue both with their peers, who are actively involved in this evolution, and with professors, who have previously been through this process themselves, and who are ensuring that it continues to take place in current students.\n\nAttendance is free and includes complimentary lunch, refreshments, and prize raffle entry. Register at this link to attend: https://www.eventbrite.ca/e/aus-humanities-social-sciences-conference-innovation-tickets-19670470908\n\nCRITERIA FOR SUBMISSIONS:\nWe are accepting submissions as of NOVEMBER 16, 2015 - DECEMBER 16, 2015. \n\nWe welcome submissions of presentation proposals from all universities and colleges in BC. Students may present work done as term papers, honours theses, or independent research projects; works in progress may also be eligible. Presentations should be no longer than 15 minutes, in English, and should represent work done while the presenter was an undergraduate student. The deadline for submissions is December 16th, 2015.\n\nThis year we have extended our submissions to include the work of Fine Arts students. Submissions can be 2D or 3D art pieces. Canvases may not be smaller than 12’ X 12” and no larger than 36” X 48”.\n\nFor more information: \nhttp://aus.arts.ubc.ca/events/conference/\nOR send us an email on: \naus.conference@gmail.com\n\n#thisisyourhAUS #12000strong", "start_time": "2016-01-16T10:30:00-0800", "end_time": "2016-01-16T17:30:00-0800", "name": "The AUS Presents: The AUS Humanities & Social Sciences Conference", "place": {"name": "AMS Student Nest", "location": {"city": "Vancouver", "country": "Canada", "latitude": 49.266485668, "longitude": -123.24990050775, "state": "BC", "street": "6133 University Boulevard", "zip": "V6T 1Z1"}, "id": "1650598338487394"}, "id": "1639893986258522", "owner": {"name": "UBC Arts Undergraduate Society", "id": "107744622618307"}}, {"description": "Hello Arts students of UBC! Get ready, get pumped, and get some Arts pride!\n\nThe second term of the school year is approaching (already?!), and that means it is time for the Arts Undergraduate Society to present you its annual Arts Week!\n\n❖❖❖❖❖❖❖❖❖❖❖❖❖❖❖❖❖❖❖❖❖❖❖❖❖❖❖❖❖❖❖❖❖❖❖❖❖❖❖\n\nWHAT IS ARTS WEEK?\nArts Week is a full week of events dedicated for creating Arts pride, community, and happiness! The events this week range from informative, healthful, and loads of fun! \n\nWHEN IS ARTS WEEK?\nArts Week takes place the second week after the Winter Break, from January 11 to 16!\n\nWHAT ARE THE EVENTS?\n—Monday, Jan 11—\n❖Clubs In the Sub\n❖Pancake Breakfast @9-11am in the Nest \n❖Trivia at The Pit @8pm\n\n—Tuesday, Jan 12:—\n❖Free Coffee & Hot Chocolate: Mural Unveiling @11-1pm in MASS\n❖Wine and Cheese: http://on.fb.me/1S0iIUH \n\n—Wednesday, Jan 13—\n❖Wellness Fair @12-3:30pm\n❖Pop Up Ping Pong @11-1pm\n❖Zumba class: http://on.fb.me/1Jq1uxk \n\n—Thursday, Jan 14—\n❖Live Music & BBQ @11-2pm\n\n—Friday, Jan 15—\n❖Purple: Storm the Pit: http://on.fb.me/1MPIrHE\n❖The Calendar + AUS FYC Present Garbagé: http://on.fb.me/1R7UnfJ\n\n—Saturday, Jan 16—\n❖AUS Humanities & Social Sciences Conference: http://on.fb.me/1PcfNlU\n\n\nCONTESTS AND PRIZES?\nWe would love to see your AUSome pictures from Arts Week! For each event, we will be selecting one winner from Instagram to be awarded with 5 drink tickets for our Purple: Storm the Pit party! Use the hashtags #UBCArtsWeek2016 in your Arts Week post so you can be entered into our contest. Limit to one entry per event (the more events you attend, the higher your chance of winning!) \n\n\n❖❖❖❖❖❖❖❖❖❖❖❖❖❖❖❖❖❖❖❖❖❖❖❖❖❖❖❖❖❖❖❖❖❖❖❖❖❖❖\n\nWe’re looking forward to seeing you all there at this week for YOU! #12000strong #thisisyourhAUS", "start_time": "2016-01-11T00:00:00-0800", "end_time": "2016-01-16T21:50:00-0800", "name": "The AUS Presents: ARTS WEEK 2016", "place": {"name": "UBC Arts Undergraduate Society", "location": {"city": "Vancouver", "country": "Canada", "latitude": 49.268148333003, "longitude": -123.25420007774, "state": "BC", "street": "Buchanan D-140, 1866 Main Mall", "zip": "V6T 1Z1"}, "id": "107744622618307"}, "id": "556696841148520", "owner": {"name": "UBC Arts Undergraduate Society", "id": "107744622618307"}}, {"description": "Welcome to the first UBC Slam Poetry writing workshop of the semester! The workshops last semester were a success and I am very excited to keep on writing and performing with you. UBC Slam will run biweekly writing workshops where we will do writing exercises, performance exercises, and stage technique. These workshops will be every other Tuesday.\n\nWe have booked a room in the Student Nest for the workshop! I will see you at 1pm in room 2528.\n\nI am very excited for this workshop! If you have a piece you have been working on and want to workshop it, bring it with you and we will listen and give feedback!\n\nThank you,\nMariah Dear\n604-318-6587\n\n***UPDATE***\nThere will be free coffee at this workshop! Bring a mug to help out, but we will have a few paper cups available too!", "start_time": "2016-01-19T13:00:00-0800", "name": "UBC Slam Poetry: Writing Workshop #1 of 2016", "place": {"name": "AMS Student Nest", "location": {"city": "Vancouver", "country": "Canada", "latitude": 49.266485668, "longitude": -123.24990050775, "state": "BC", "street": "6133 University Boulevard", "zip": "V6T 1Z1"}, "id": "1650598338487394"}, "id": "1707242762852328", "owner": {"name": "UBC Slam Poetry", "id": "701309313253008"}}, {"description": "Our first big  event of 2016 is finally here. We'll be kicking off the first of four SOUL CRAVINGS meetings this week! \n\nAll of the sessions are led by students and will feature a variety of presentations, discussions, and videos that will try to engage you and ask you to consider some of these big questions and desires that we have in our lives.\n\nThe first topic that we'll be tackling is: Change in the World\n\nInterested? Curious? Just dropping by? Showing up for the free food (yes, free food!). All are welcome, see you there!", "start_time": "2016-01-21T17:00:00-0800", "end_time": "2016-01-21T19:00:00-0800", "name": "Soul Cravings: Session 1", "place": {"name": "UBC NEST Lev Bukhman Theatre Lounge"}, "id": "1266931630000240", "owner": {"name": "UBC Power to Change", "id": "276462869034451"}}, {"description": "The Mentorship Program is the biggest and probably most important aspect of our club. First year CSP students who are members of our club have the unique and enriching opporutnity to be paired with an alumni CSP student as their mentor. A mentor would guide you through the process of discovering specialization options, summer school courses, volunteer opportunities, extracurricular activities, and many many more. \n________________________________________________\n\nMentorship Night is the perfect time and place to meet mentors and mingle with some alumni CSP students who have been through exactly what you are going through!\n\nYou can also purchase your $2 (only) club membership at this event!!! Members benefit from having an assigned mentor, free access to events hosted by our club and free food/stuff here and there. \n\nCOME OUT AND HAVE SOME FUN WITH US!\n- EAT FOOD\n- PLAY GAMES & ACTIVITIES\n- ASK QUESTIONS\n- GET YOUR MEMBERSHIP\n- MINGLE (before the first wave of midterms hit!)\n\nMembers and Non-members: FREE \n(Only this event will be free for everyone!)\n_______________________________________________\n\nSTAY TUNED for fun facts about the mentors you will be meeting!\n\nQuestions: csp.mentorshipclub@gmail.com", "start_time": "2016-01-26T16:00:00-0800", "end_time": "2016-01-26T19:00:00-0800", "name": "CMC MENTORSHIP NIGHT", "place": {"name": "Abdul Ladha Science Student Centre", "location": {"city": "Vancouver", "country": "Canada", "latitude": 49.2661219, "longitude": -123.2510003, "state": "BC", "street": "2055 East Mall", "zip": "V6T 1W5"}, "id": "152819448084339"}, "id": "1675255416065093", "owner": {"name": "CSP Mentorship Club", "id": "542030372619657"}}, {"description": "Beef and Pizza is one of the larger academic events the ECE Student Society holds. The society invites both ECE students and professors to a meeting, where students can talk to profs about concerns they have with the curriculum, as well as receiving free pizza.\n*****************************************************************\nLocation: Kaiser 2020/2030\n\nDate: Jan. 27 Wed. 12-1:30pm\n\nWe encourage you to submit your questions and feedback (both positive and negative) ahead of time. Please fill out the following form. If you are not able to attend in person, we can ask the panel of instructors on your behalf.\nhttp://goo.gl/forms/vEZQHNDSs6\n*****************************************************************\nAttending:\nProfessor Konstantin Beznosov (12:30)\nProfessor Farshid Agharebparast\nProfessor Andre Ivanov\n.......\nmore to come!", "start_time": "2016-01-27T12:00:00-0800", "name": "[ECESS] Beef and Pizza", "place": {"name": "Kaiser Building UBC", "location": {"city": "Vancouver", "country": "Canada", "latitude": 49.262059771566, "longitude": -123.25009180478, "state": "BC"}, "id": "159390144087566"}, "id": "1172887396072767", "owner": {"name": "UBC Electrical & Computer Engineering Student Society (ECESS)", "id": "359994484090375"}}, {"description": "Are you interested in making a difference in someone’s life? Do you want to give back to society? Do you like FREE FOOD?\nIf so, come out and save lives by wearing green and DONATE BLOOD during Kin Week in the ballroom at Totem Park Residences from 11:00am to 2:00pm.\n\nAfter you donate there will be a FREE BBQ at OSBORNE!!! Come and endulge in some burgers and hot dogs after you give back or if you can't donate just stop by for FREE FOOD.\nBLEED GREEN!\n\n*Appointments can be booked at blood.ca/donate or call 1-888-2-DONATE*\nSpaces are filling up so book your time asap!\nDrop-ins will also be welcome at the clinic, however space is limited and there is no guarantee that there will be a space available at your desired time.\n**FAQS**\nAm I eligible? \nhttps://www.blood.ca/en/blood/abcs-eligibility and https://www.blood.ca/en/eligibility-quiz\nHow does the donation work?https://www.blood.ca/en/blood/how-donation-works\n\nHope to see you all there!\nxoxo \nKUS Execs", "start_time": "2016-01-21T11:00:00-0800", "end_time": "2016-01-21T14:00:00-0800", "name": "KIN WEEK 2016: KINtribute to a Life", "place": {"name": "UBC Life Science Building", "location": {"city": "Vancouver", "country": "Canada", "latitude": 49.262411546792, "longitude": -123.24516588404, "state": "BC", "zip": "V6T"}, "id": "229775430431256"}, "id": "500894633425290", "owner": {"name": "UBC Kinesiology Undergraduate Society - KUS", "id": "180718128655354"}}], key: "January" }, {"data": [{"description": "Join us on Saturday, February 27th for VSEUS's 3rd annual conference, where experts in various areas will be discussing today’s gender issues and how to change the face of leadership in the workplace.\n\nSpeakers include members of UBC's Vancouver School of Economics, Ernst & Young, Coast Capital Savings, Surrey Board of Trade and many more! After hearing their expert opinions, we will open the floor for discussion.\n\nFREE lunch will be provided. This conference provides an excellent opportunity to debate the potential economic, work and social implications of gender in the workplace, so be sure to attend!\n\nBusiness casual attire\n\nLocation: IONA 301\n\nSCHEDULE\n\n 9:00 am- Arrival and coffee (please arrive before 9:45)\n\n10:00 am- Introduction to the conference \n\n10:10 am- Session 1: The Economics of Workplace Gender Issues\n\n10:55 am - Coffee Break\n\n11:00 am- Session 2: Experiences with Gender in the Workplace\n\n12:30 pm - Lunch and Networking\n\n13:30 pm - Session 3 : Changing the Face of Leadership\n\n3:00 pm - Closing remarks\n\nRSVP here: http://bit.ly/1PpWqIU\n\nFEATURED PRESENTERS\n\nNicole Fortin - Professor @ UBC VSE\n\nLawrie Ferguson - Chief Marketing @ Coast Capital Savings\n\nMichelle Grant - Senior VP, Transaction Advisory @ Ernst & Young\n\nEllen Bird - Exec. Director @ BC Women in Energy Network, \nVP @ Sea Breeze Power Corp\n\nBarinder Rasode - Co-founder @ SheTalks, former City of Surrey Councillor\n\nJill Earthy - Board Member @ Women's Enterprise Centre\n\nAnita Huberman - CEO @ Surrey Board of Trade\n\nTracy Theemes - Co-founder @ Sophia Financial Group\n\nPaulina Cameron - Board of Directors Chair @ Young Women in Business\n\nEmily Ohler - CEO & General counsel @ Broadleap Solutions Ltd., former Legal and program Officer @ UN Compensation Comission", "start_time": "2016-02-27T09:00:00-0800", "end_time": "2016-02-27T14:45:00-0800", "name": "VSEUS Presents: 3rd Annual Conference - Gender in the Workplace", "place": {"name": "UBC Vancouver School of Economics Undergraduate Society", "location": {"city": "Vancouver", "country": "Canada", "latitude": 49.2710558, "longitude": -123.2504111, "state": "BC", "street": "035 Iona, 6000 Iona Drive", "zip": "V6T 1L4"}, "id": "276923702337235"}, "id": "829038110552523", "owner": {"name": "UBC Vancouver School of Economics Undergraduate Society", "id": "276923702337235"}}, {"description": "WHAT’S UP First Years! Way Back Wednesday was fun & now your FYC is bringing you another one!\n\nValentine’s Day is on February 14, but THE 25TH is where the real fun is. Celebrate returning from Reading Break with your FIRST YEAR COMMITTEE at…\n\n☞[MINUTEMATCH]\nValentine’s Day is overrated anyways, so FYC is hyped to present you the opporunity to get MATCHED on a GROUP DATE and  MATCH  in “minute-to-win-it” style games with a chance to awesome PRIZES, listen to some GOOD music, and  kick it with new friends ! \n\n☞[WHEN]\nThursday, February 25th @ 6:00pm - 8:30pm (sign-in starts at 5:30pm)\n\n☞[WHERE]\nBirmingham @ Henry Angus \n\n☞[WHY COME?]\nFREE FOOD: [STAY TUNED FOR INFO]\n\nFUN PEOPLE: Who’s more fun than your fellow 1st years\n\nSPECTACULAR PRIZES (from The Bubble Tea Shop & more)\n\nEnjoy another chill, laid-back night with good food and even better people! \n\nWhat could possibly make this better?\nPerhaps a photobooth and a sundae bar \n\nCOMPETE: In intense MINUTE-TO-WIN-IT style games with your MATCHED quadruple DATES (team members) with the chance to win great PRIZES.\n\n☞[DRESS CODE]\nCasual & Comfy \n\n☞[PRICE]\nFREEEE \n\n☞[WHO]\nFIRST YEAR SAUDER STUDENTS \n\nLIMITED SPOTS AVAILABLE GRAB YOUR FRIENDS\nSIGN UP NOW\n☛RSVP HERE☚\nhttp://goo.gl/forms/6UIKaA73Ej\n================================================\nP.S…\nAdd us on SNAPCHAT @cusfyc for exclusive sneak peeks at Sponsors and other cool things!", "start_time": "2016-02-25T17:40:00-0800", "end_time": "2016-02-25T20:30:00-0800", "name": "90% FULL! CUSFYC Presents: MinuteMatch", "place": {"name": "Henry Angus", "location": {"city": "Vancouver", "country": "Canada", "latitude": 49.265247514766, "longitude": -123.25345486377, "state": "BC"}, "id": "131503716899027"}, "id": "824216101037765", "owner": {"name": "CUS First Year Committee", "id": "152509691777732"}}, {"description": "Brrrrr its cold outside, so get some FREE HOT CHOCOLATE & BUY SOME BAKED GOODS!! \nWe'll be outside Ladha from 11AM-2PM on Feb 5th!\nOur proceeds go to funding education in Latin America, so be sure to check us out! :)", "start_time": "2016-02-05T11:00:00-0800", "end_time": "2016-02-05T14:00:00-0800", "name": "FREE HOT CHOCOLATE & BAKE SALE - UBC Students Offering Support [UBC SOS]", "place": {"name": "Abdul Ladha Science Student Centre", "location": {"city": "Vancouver", "country": "Canada", "latitude": 49.2661219, "longitude": -123.2510003, "state": "BC", "street": "2055 East Mall", "zip": "V6T 1W5"}, "id": "152819448084339"}, "id": "1056752507710096", "owner": {"name": "UBC SOS - Students Offering Support", "id": "1674187279533901"}}, {"description": "Back to learning things: reading break is over. What better way to ease back into that lovely midterm season than an EUS tutoring session? Study packages, helpful upper years... you know the drill. \n\nWe will be in EDC 102, with overflow rooms in EDC 301 and 303 (the APSC 101 rooms). Get ready for physicsss\n\nTHERE WILL ALSO BE FREE PIZZA\n\nubcengineers.ca/tutoring", "start_time": "2016-02-22T18:30:00-0800", "end_time": "2016-02-22T21:00:00-0800", "name": "EUS Tutoring: PHYS 158", "place": {"name": "EDC 102 (& 301 & 303 for overflow)"}, "id": "1164539700225480", "owner": {"name": "UBC Engineering Undergraduate Society", "id": "171391373016630"}}, {"description": "How do we shift from the ruthless exploitation of nature toward cooperation with it?\n\nFaced by financial crisis, climate change, scarce resources and social injustice, we've reached a point where societies need to re-evaluate how to grow in a more sustainable manner. \n\nJoin recognized author and activist Ralf Fücks as he discusses his new book that addresses some of these critical questions and discusses a new approach to economics, innovation and proactive policymaking that seeks to overcome the dangers posed by climate change.\n\nFree. Registration required. Lunch provided.\n\nPhoto credit (shared under Attribution-ShareAlike 2.0 Generic):\nDowntown Vancouver Sunset, Magnus Larsson  / Flickr", "start_time": "2016-02-29T12:00:00-0800", "end_time": "2016-02-29T13:00:00-0800", "name": "Smart Growth: From Exploitation to Cooperation with Nature", "place": {"name": "UBC Liu Institute for Global Issues", "location": {"city": "Vancouver", "country": "Canada", "latitude": 49.267536810518, "longitude": -123.25945227601, "state": "BC", "street": "6476 NW Marine Drive", "zip": "V6T 1Z2"}, "id": "221355054597138"}, "id": "1723163137904999", "owner": {"name": "UBC Sustainability", "id": "110119109055867"}}, {"description": "Are you currently looking for a co-op work placement? Are you nervous about looking for your first work placement? \nAre you looking to polish your interview skills for a challenging interview?\nAre you looking forward to having experienced co-op students give you advice on your cover letter or resume? \n\nScience Co-op Students Associations (SCOOPS) will be hosting a three-in-one package to help you! We will offer one on one  resume, cover letter and mock interview workshops for all those currently applying for science co-op jobs or are interested.\n\nWe will have SPECIFIC industry/job targeted questions to help you bring on your A game to the real interview. \n\nIn addition, we will have FREE Linkedin headshots taken so that you can create/update an epic Linkedin profile for yourself!\n\n**Refreshments will be provided. Availability is on first come first serve basis. **\n\nDRESS CODE: Business casual\n\nTo get the most out of this workshop, please comment below on the type of co-op jobs that you are interested in applying for\nso we can tailor our questions for you.\n\nLooking forward to seeing you soon!", "start_time": "2016-02-04T18:00:00-0800", "end_time": "2016-02-04T19:30:00-0800", "name": "3 in1 Workshop: Resume/CL, Interview + FREE Linkedin Headshots", "place": {"name": "Rooms 2131 at The Nest"}, "id": "1543316819314839", "owner": {"name": "UBC Science Co-op Students Association", "id": "126302794138107"}}, {"description": "Hey Civils!\n\nFor those of you unfamiliar with this event, what's it all about!?\nIt's an opportunity to discuss any issues or improvements that you hope to see in your classes.\n\nWe hope to get positive and negative feedbacks about your CIVL courses!\n\nHere are the dates and times corresponding to year:\n\n2nd Years: (Wednesday) Feb 24 11am - 12 pm\n3rd Years: (Wednesday) Feb 24 12 pm - 1 pm\n4th Years: (Monday) Feb 29 12 pm - 1 pm AND 1pm - 2pm\n\nSIDENOTE: The department will be providing FREE pizza to anyone who attends.", "start_time": "2016-02-24T11:00:00-0800", "end_time": "2016-02-29T13:00:00-0800", "name": "Civil Club Presents: Beef and Pizza!", "place": {"name": "Civil Design Studio"}, "id": "980723278642680", "owner": {"name": "UBC Civil Club", "id": "127516137761"}}], "key": "February"}, {"data": [{"description": "One year has passed by in the blink of an eye, and it is once again time for us to elect a new SSA Executive Committee! (If you are interested in applying for an exec position, don't forget to check out the details on how to apply at the bottom of this description.)\n\nThis will be the final event hosted by the current executive committee, and it has truly been our honour to serve you over the past year.\n\nDuring this special event, we will be listening to the election speeches from our candidates and voting for next year's exec team. We would like to encourage you to exercise your right to vote and let us know where the club should be headed in the future. We believe that every member of the SSA is important to the club's success, and we welcome your opinions and decisions on which individuals you believe will help lead and improve the club in the following year. \n\nDon't miss out on this great opportunity to celebrate an awesome year together with the club at our final event! There will be free food (chicken rice!) served for members and wonderful company as usual.\n\nDATE: Friday, March 11th, 6-9pm\nLOCATION: The AMS Nest, Performance Theatre (known to some as The Egg)\n\nPrice: \nMembers: FREE\nNon-members: $8\n\nPlease RSVP and let us know if you are attending our event!\n\n-----------------------------------------------------------------------------\n\nINFORMATION FOR ELECTION CANDIDATES:\n\nPlease fill out this application form if you are interested in applying for a position on the executive committee: http://goo.gl/forms/PJw06S7KfX\n**Applications are due by March 4th**\n\nCheck out the following PDF document for a more detailed description of each position's duties and requirements: https://drive.google.com/file/d/0B_mQx88dKNNkLWlrT1UteTBMTGs/view?usp=sharing\n\nStay tuned for updates!", "start_time": "2016-03-11T18:00:00-0800", "end_time": "2016-03-11T21:00:00-0800", "name": "SSA Elections Night 2016", "place": {"name": "AMS Student Nest", "location": {"city": "Vancouver", "country": "Canada", "latitude": 49.266485668, "longitude": -123.24990050775, "state": "BC", "street": "6133 University Boulevard", "zip": "V6T 1Z1"}, "id": "1650598338487394"}, "id": "799851023470962", "owner": {"name": "UBC Singapore Students' Association", "id": "880262285394994"}}, {"description": "All UBC Human Resources Management Club members are invited to our Annual General Meeting!\n\nWant to have a say in who runs the club next year? Come out for FREE PIZZA and VOTE for next year’s UBC HRMC President. An online polling link will be available for members who are not able to make it out to the event. \n\nDate: Wednesday, March 2nd\nTime: 5:15pm - 6:00pm\nLocation: Room 332, Henry Angus Building\nWho: All HRMC members\n\nInterested in being President of the UBC Human Resources Management Club for the 2016/2017 academic year? \n\nYou may apply as President or Co-President (if you are applying for Co-President, you must choose a partner and apply together). *** YOU DO NOT NEED TO BE A CURRENT MEMBER OF HRMC TO RUN TO BE PRESIDENT***\n\nTo apply, send Candice a statement of interest (300 words maximum for President, 500 words maximum for Co-Presidents) for the position to hrmc.communications@gmail.com before 11:59PM on Monday, February 29th. All candidates must prepare a speech (maximum 5 minutes in length) for voting.\n\nOnce a president has been elected, executive positions will be released.\n\nPlease direct any questions to hrmc.communications@gmail.com, or shoot us a message directly on Facebook.", "start_time": "2016-03-02T17:15:00-0800", "end_time": "2016-03-02T18:00:00-0800", "name": "ANNUAL GENERAL MEETING & HIRING | UBC Human Resources Management Club", "place": {"name": "UBC Sauder School of Business", "location": {"city": "Vancouver", "country": "Canada", "latitude": 49.2654365, "longitude": -123.2537487, "state": "BC", "street": "2053 Main Mall (Henry Angus)", "zip": "V6T 1Z2"}, "id": "152000511496023"}, "id": "1768081013415123", "owner": {"name": "UBC Human Resources Management Club (HRMC)", "id": "127848030616378"}}, {"description": "It's time for YWiB UBC's Annual General Meeting (AGM) and all members are invited!\n\nWant to have a say in who will be part of YWiB UBC’s executive team next year? Here’s your chance! We have some great candidates eager to share with you their platform. Did we also mention that there will be free food?!\n\nDate: Wednesday, March 9th\nTime: 6:00pm – 8:30pm\nLocation: Room 243, Henry Angus Building\nCost: Free (This event is only open to YWiB UBC members)\n\nFREE FOOD? Your chance to VOTE? What more can you ask for? Come join us in wrapping up a wonderful year!", "start_time": "2016-03-09T18:00:00-0800", "end_time": "2016-03-09T20:30:00-0800", "name": "YWiB UBC: Annual General Meeting", "place": {"name": "HA 243"}, "id": "199215677110883", "owner": {"name": "YWiB UBC", "id": "139861602723013"}}, {"description": "As you may know, BC has recently released the Climate Leadership Team recommendations for the province’s Climate Leadership Plan, and has just launched its public consultation on future climate action. This event will include free pizza!\n\nThis is indeed an important time for determining future climate action for BC, and the Pacific Institute for Climate Solutions (PICS) at UBC and Common Energy UBC want to help UBC students get informed and involved. As such, we are working together to host a panel session, comprised of three engaged and informed UBC faculty, students, Climate Leadership Team and/or Pembina Institute representatives, on the climate action options for the province. \n\nWe’re aiming to have the session offer student’s a brief overview on the Climate Leadership Team recommendations, as well as other ideas, insight and action that can help position BC as a climate leader. We’d also like the discussion to encourage students to participate in the province’s consultation process.", "start_time": "2016-03-14T17:00:00-0700", "end_time": "2016-03-14T19:00:00-0700", "name": "Deciding BC’s Future Climate Action", "place": {"name": "Centre for Interactive Research on Sustainability", "location": {"city": "Vancouver", "country": "Canada", "latitude": 49.262, "longitude": -123.253, "state": "BC", "street": "2260 West Mall", "zip": "V6T 1Z4"}, "id": "592585644098904"}, "id": "1115796248465192", "owner": {"name": "Common Energy UBC", "id": "131176050310201"}}, {"description": "JOIN UBC BLOOD FOR LIFE, UBC CMSSA, and UBC PERSIAN CLUB NEXT THURSDAY!\n\n♥ ♥ ♥ ♥ Short Description ♥ ♥ ♥ ♥\nStop by our booth to learn how to donate blood to patients (on campus), how to donate to research (also on campus!), how to become a potential stem cell donor and what it means to be a potential stem cell donor (takes only 5-10minutes and a cheek swab! but can make the difference in saving someone's life who is dying of a blood-related disease!) \n\nOR just stop by to say hi and grab some free cookies/ chocolates! \n\nWe'll be boothing outside of the UBC Bookstore as well in the Buchanan Courtyard between 11 AM - 4:30 PM.\n\n♥ ♥ ♥ ♥ Long Description ♥ ♥ ♥ ♥ \n\nDid you know that every 10 minutes, a person is diagnosed with leukemia? \n\nDid you also know that signing up to be a potential stem cell donor takes about the same amount of time? \n\nThis is a great oppurtunity for you to learn more about stem cells and blood donations, and sign up to be a potential donor yourself to help save lives around you. If you’ve ever been interested in blood donation or becoming a part of the stem cell registry, or have any questions about the process or how to sign up, this is a great place to start. Our volunteers would love to talk to you more about any questions you may have.\n\nNot interested in stem cell donations? Not to worry, we will also be holding a table to sign up for blood donations with Canadian Blood Services! You won't want to miss it!\n\n\"At any given time close to 1,000 Canadians are waiting for a stem cell match - and for a future full of hope.\" \n-- Canadian Blood Services\n\nCheck out some of these links for more information about\nStem cell donations:\nhttps://www.blood.ca/en/stem-cell/donation-process#\nhttps://www.blood.ca/en/stem-cell/myths-about-stem-cell-donation\nhttps://www.blood.ca/en/stem-cell/what-happens-if-im-match\n\nBlood Donations:\nhttps://www.blood.ca/en/blood\nhttps://www.blood.ca/en/blood/who-does-my-donation-help\nhttps://www.blood.ca/en/blood/can-i-donate", "start_time": "2016-03-03T11:00:00-0800", "end_time": "2016-03-03T16:30:00-0800", "name": "UBC B4L & CMSSA & PERSIAN CLUB PRESENT: Grand Finale STEM CELL DRIVE", "place": {"name": "UBC Bookstore and Buchanan Courtyard"}, "id": "549820368514921", "owner": {"name": "UBC Blood for Life Club", "id": "282157491944662"}}, {"description": "Amnesty International UBC will be hosting its FREE annual conference on March 19th! Come join us to discuss a topical issue in human rights: human migration.\n\nThis year's conference will examine topics of human migration around the world, including conflict-induced migration from Syria, undocumented migration in North America, and refugee law and resettlement in Canada. \n___________________________________________________\n\nSchedule:\n\n11:30am – 12:00pm: Check-in and icebreaker!\n12:00 – 12:30: Student Speaker\n12:30 – 1:10: MOSAIC\n1:10 – 1:50: Lunch\n1:50 – 2:30: ISSofBC\n2:30 – 2:40: Break\n2:40 – 3:20: CARL (subject to change)\n3:20 – 3:30: Break\n3:30 – 4:00: Interactive workshop with the Social Justice Centre\n\nStay tuned as we will be updating this event page with additional information regarding this year's Speakers!\n___________________________________________________\n\nEvent information: \n\nWhere?      Allard Hall, Rm. 105\nWhen?       March 19th: 11:30am (check-in) to 4:00pm\nFree Snacks?    Yes! Sushi, pizza, and refreshments will be provided!\n\nFor ticketing, you can access our eventbrite page here: https://www.eventbrite.ca/e/humans-without-borders-a-global-perspective-on-migration-tickets-22369894958", "start_time": "2016-03-19T11:30:00-0700", "end_time": "2016-03-19T16:00:00-0700", "name": "Humans Without Borders: a Global Perspective on Migration", "place": {"name": "Peter A. Allard School of Law", "location": {"city": "Vancouver", "country": "Canada", "latitude": 49.270018369517, "longitude": -123.25335917955, "state": "BC", "street": "Allard Hall, 1822 East Mall", "zip": "V6T 1Z1"}, "id": "180644975280905"}, "id": "1683886071867158", "owner": {"name": "Amnesty International UBC", "id": "159692987393117"}}, {"description": "{ DAY 2  IS CANCELLED }\n\nYou came. You saw. You (almost) conquered!\n\nBut the Enginners aren't done yet!\n\n▬▬▬▬▬▬⠀..:: D A Y   2 ::..⠀▬▬▬▬▬▬\n\nDay 1 gave us all a chance to see all the amazing things that the engineering student teams build. Now let's get involved! On March 26th, 50 delegates from Sauder will get a tour from the Engineering student teams, and provide them with openings in their teams!\n\nWHEN: Saturday, March 26th \nTIME: 10 am - 4 pm\nWHERE: Engineering Design Centre \nDRESS CODE: Whatever you like!\nPRICE: $10 \n\nE X P E C T:\n\n★  Tour of Engineering Team's work enviroment. \n\n★  Business Opportunities!  Engineering Student Teams will present to you openings in their teams where specific business skills are required.\n\n★ FREE food and light refreshments! (as part of your ticket )\n\n★ Causal Mixer! Land yourself a spot in a team, or just simply make new friends! \n\n\nDAY 2 ITINIERARY:\n▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬\n \nRegistration                                           10:00 – 10:30\n\nOpening Speech                                   10:30 – 11:00\n\nWorkshop 1                                           11:00 – 11:45\n\nLunch                                                     11:45 – 12:15\n\nWorkshop 2                                            12:15 – 1:00\n\nBreak                                                      1:00 – 1:15\n\nWorkshop 3                                            1:15 – 2:00\n          \nClosing Remarks                                     2:00 – 2:30\n\nSauder x Engineering Mixer                    2:30 – 4\n\n▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬\n\nWHY ARE WE DOING THIS ?\n\nWe want to connect Sauder with the rest of UBC and illuminate the opportunities available for Sauder students to apply their skills and gain hands-on experience by working on the many amazing products built by the Engineering Student Teams.\n\n▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀\nSee y'all there!!!!\n♥ Your Commerce Undergraduate Society", "start_time": "2016-03-16T11:00:00-0700", "end_time": "2016-03-16T14:00:00-0700", "name": "CUS Presents: The Engineering Team Fair", "place": {"name": "UBC Sauder School of Business"}, "id": "960364754041565", "owner": {"name": "UBC Commerce Undergraduate Society", "id": "64895937030"}}, {"description": "Are you interested what career paths your Psychology degree can lead to? Join us for Career Night on March 17th, 5-7:30pm at Henry Angus 254. Students will have a chance to hear from 6 UBC alumnus with background in psychology pursuing diverse professions, including but not limited to Program Assistant, Social/health services, Youth worker, and Marketing specialist. \n\n**Light dinner and refreshments will be provided! \nRSVP required - http://goo.gl/forms/HIZZKhTKGv\n\nEvent details:\n5-6: Panelists talk \n6-6:30: Student Q & A\n6:30-7: Small discussion group*\n-Students will gain a chance to engage more with a panelist of their choice\n7-7:30: Mix & mingle (optional)\n\nBios about some of the panelists:\nhttp://psa-psych.sites.olt.ubc.ca/?p=1467", "start_time": "2016-03-17T17:00:00-0700", "end_time": "2016-03-17T19:30:00-0700", "name": "PSA Presents: Career Night", "place": {"name": "UBC Sauder School of Business", "location": {"city": "Vancouver", "country": "Canada", "latitude": 49.2654365, "longitude": -123.2537487, "state": "BC", "street": "2053 Main Mall (Henry Angus)", "zip": "V6T 1Z2"}, "id": "152000511496023"}, "id": "984104984958850", "owner": {"name": "Psychology Students' Association of UBC", "id": "275631442518010"}}, {"description": "Storm The Wall's Party At The Plaza is the perfect celebration for the end of the year! Stop by the plaza outside the Nest and enjoy lots of free programming, free food, free airbrush tattoos, free flight giveaway, live DJ and more. Be sure to join us at the Storm After Party at the PIT.\n\nEvent schedule:\n1:30: Bieber SORRY Dance Class - FREE\n3:00: Beyonce vs. Jay-Z Bootcamp - FREE\n4:00 - 7:00: DJ performance\n7:30 - onwards: Storm The Wall Awards ceremony \n8:00 - onwards: Storm After Party at the PIT\n\nStorm The Wall closing event day features:\n- Special Olympics heat\n- Super Iron Woman & Iron Man\n- Campus Wide and Division Finals\n- NEW FOR 2016: The Wall Challenge", "start_time": "2016-03-23T12:30:00-0700", "name": "Storm The Wall Party At The Plaza", "place": {"name": "AMS Student Nest Plaza"}, "id": "964290160287174", "owner": {"name": "UBC REC", "id": "124560474228521"}}, {"description": "If you are considering a career in law, come out for free pizza and bring all the questions you have about law school and about Allard School of Law!\n\n\nWe are very fortunate to have 6 Allard Student Ambassadors coming out to provide thorough and candid impressions as well as information about the Allard School of Law to applicants and admitted students, and information that could assist with the transition to law school.\n\n\nThe Student Ambassador Program is designed to assist prospective and admitted students in gathering the necessary information to make an informed decision about applying to or accepting an offer from the Allard School of Law. \n\n\nYou might wonder:\n• what’s law school really like: classes, professors, daily life?\n• what career paths are in law\n• what truly counts in the admissions process\n• how to make your application stand out\n\nThis event requires a PSSA membership. If you do not have one we will be selling them at the door! Pizza will be limited so it is first come first serve, max two slices per student. We are keeping the limit on students at 40 so that there can be an effective Ambassador to Student ratio.\n\n\n#ubcpssa\n#allardschooloflaw", "start_time": "2016-03-21T17:00:00-0700", "end_time": "2016-03-21T18:30:00-0700", "name": "The PSSA Presents: Pizza with a Law Student", "place": {"name": "UBC Political Science Students' Association - UBC PSSA", "location": {"city": "Vancouver", "country": "Canada", "latitude": 49.26858, "longitude": -123.24906, "state": "BC", "street": "6138 Student Union Boulevard"}, "id": "457541780945864"}, "id": "1750614788500245", "owner": {"name": "UBC Political Science Students' Association - UBC PSSA", "id": "457541780945864"}}, {"description": "Have you ever wondered what furry robots were?\n\nCome out to CSSS's second Talk to the Professors event to meet two amazing professors! Hear a short presentation about their interests, and get to meet them over FREE PIZZA. \n\nSocializing and networking highly encouraged - come for all or part of the event :)\n\nSpeakers:\n\nProfessor Karon MacLean (topic - What's Hard About Furry Robots?)\nProfessor Mike Feeley (topic - Where To Store Your Stuff)", "start_time": "2016-03-11T13:00:00-0800", "name": "CSSS Presents: Talk to the Professors!", "place": {"name": "ICICS X860"}, "id": "448884931970732", "owner": {"name": "UBC Computer Science Student Society - CSSS", "id": "1035693569787773"}}, {"description": "Friends of MSF (Doctors Without Borders) will be hosting an MSF Awareness Week to draw attention to key MSF campaigns and global health issues. \n\nCome to each day to get free food and get entered into a raffle for a full free PIZZA!\n\nMon. March 21st @ Abdul Ladha (11-3 pm): A Fair Shot Campaign - http://www.afairshot.org/\nPneumonia causes the death of nearly 1 million children every year. Despite the availability of a vaccine to treat pneumonia, it costs 68x more to immunize a child now in 2016 than it did 15 years ago. Two pharmaceutical companies – Pfizer and GSK – are largely to blame for the significant increase in the cost of these vaccines. The goal of the ‘Fair Shot Campaign’ is to urge Pfizer and GSK to reduce the price of the pneumonia vaccine from $10 to $5. So come out and support the campaign by signing the petition!\n\nTue. March 22nd @ Abdul Ladha (10-4): Hospital bombings #NotATarget - http://www.msf.ca/NotATarget\nWe are hosting a Photobooth for the #NotATarget campaign in support of MSF. The campaign originated to stand in solidarity with civilians, patients, medical workers and hospitals who continue to be targeted victims of attacks by armed groups around the world; To highlight the horrific consequences of targeted attacks on people; and To demand the right of humanitarian workers to provide humanitarian care to people in need, particularly in conflict zones. Participants are also invited to sign a petition with us condemning such attacks.\n\nWed. March 23rd @ The Nest (10-4 pm): World Tuberculosis (TB) Day - https://msfaccess.org/TBmanifesto/\nWorld TB Day strives to raise awareness about the severe lack of accessible treatment to TB in third-world countries as the rise of muti-drug resistant TB continues. Affecting more than 12 million people worldwide, it is essential for us to be aware of the need of proper distribution of TB treatment and diagnosis as TB becomes harder and harder to control and cure.\n\nThu. March 24th @ The Nest (9-6 pm): Malnutrition Tent - http://www.msf.ca/en/malnutrition\nPoor nutrition causes nearly half (45%) of deaths in children under fiver (3.1 million per year). Want to learn how people get assessed for malnutrition in the field? Come and participate in our simulated assessment and learn about the signs of malnutrition. Thursday, 24th at the Nest from 9-6pm", "start_time": "2016-03-21T00:00:00-0700", "end_time": "2016-03-25T03:00:00-0700", "name": "FoMSF presents: MSF Awareness Week 2016", "id": "522954444544181", "owner": {"name": "Friends of Médecins Sans Frontières UBC", "id": "130947100346473"}}, {"description": "This event qualifies for 25 IPE points!\n\nFor the coming Spring QuIPs conference on March 19, IHI UBC is excited to be working in collaboration with the BC Patient Safety & Quality Council to bring you the \"Change Agent Workshop Series\".\n\nFor students who have always wanted to learn how to step out of their comfort zone to become a leader, how do you make that transition from a participant to taking on a leadership role? As a leader, how can you lead differently to shift the mindset of leadership to effectively engage your team to harness individual collective energy? For those entering the professional workplace, what are the relevant skills you need in tackling the barriers you may encounter?\n\nAs the future leaders of tomorrow, let's start planting the necessary seeds to develop effective communication strategies and to build relationships that stress the importance of collaborative input in initiating change.\n\nThis will be an exciting and engaging opportunity for students interested in mobilizing to improve quality of care as well as learning the skills to become an effective change agent to do it. Free admission and lunch/refreshments will be provided.\n\nSchedule of Events\n9:00am-9:30am Registration\n9:30am-9:35am Welcome from IHI UBC\n9:35am-10:30am Towards Possibilities: Being an Organizational Change Agent\n11:00-12:30pm The Glue that Holds It Together: The Importance of Community and Building Alliances\n12:30pm-1:00pm Lunch Break\n1:00pm-1:45pm Saddle Up!: Harnessing the Power of Resistance\n1:45pm-2:45pm Keep the Fire Burning: Motivation and Maintaining Energy for Change\n\nWe're looking forward to seeing you at our Workshop Series this year.", "start_time": "2016-03-19T09:00:00-0700", "end_time": "2016-03-19T15:00:00-0700", "name": "Spring QuIP Change Agent Workshop Series", "place": {"name": "Henry Angus Room 254"}, "id": "1679765232283670", "owner": {"name": "Institute for Healthcare Improvement Open School: UBC Chapter", "id": "404167549650132"}}, {"description": "Our first panel event of 2016 will be held on the evening of March 8th in PHRM 1101 (Pharmaceutical Sciences Building), centring on end-of-life care. We will be exploring end-of life care with an emphasis on how to minimize suffering for both the patient and the family, and how to ensure dignity is maintained.\n\nWe will feature four different talks: (1) navigating options in end-of-life care, (2) a family member’s perspective on end of life, (3) optimizing care to support both patients and their family caregivers, and (4) a primer on how to talk to patients about end of life.\n\nSpeakers include Dr. Jennifer Kryworuchko (Associate Professor, School of Nursing, UBC), Joyce Sandercock (Patient Voices Network ), Dr. Kelli Stajduhar (Professor, School of Nursing and Centre on Aging, UVic), and Dr. Pippa Hawley (Division Head of Palliative Care, UBC).\n\nStudents in professional health disciplines like audiology, dental hygiene, dietetics and pharmacy will receive 25 Exposure Level Interprofessional Education (IPE) points.\n\nRefreshments will be provided.", "start_time": "2016-03-08T18:00:00-0800", "end_time": "2016-03-08T20:30:00-0800", "name": "A Pragmatic Approach to Respectful End-of-Life Care", "place": {"name": "Ubc faculty of pharamceutical sciences 1101"}, "id": "1052796024743034", "owner": {"name": "Institute for Healthcare Improvement Open School: UBC Chapter", "id": "404167549650132"}}, {"description": "Join us at old sub party room for the New Year Countdown Ceremony and a fun night!\n\nThis year, the magical Persian New Year festival of Norouz is coming to the heart of our campus at UBC!! We plan to countdown on March 19th, at the turn of the Persian New Year (that is 9:30:12 PM to put exactly!). We will celebrate the blossoming of spring  around a beautiful Haft-Seen table and the company of you beautiful people. So join us for a night filled with Persian music and dance, refreshments, finger food and pastries, Persian style tea and of course a warm environment to hang out with family and friends.\n\nDress code: Semi-formal to formal encoraged.\nFinger food, Persian pastries, tea and other refreshments will be provided. \n\n***Kick off @ 8:00 pm\n***countdown @ 9:30:12 pm \n*** party all night long \n\nنوروز امسال، قصد داریم تا لحظه تحویل سال در خارج از ایران زمین جاودانه شود. بهار را با دانشجویان دانشگاه بریتیش کلمبیا شروع کنید تا در کنار هم چشم به سالی‌ سبز داشته باشیم. شادمانه به استقبال بهار می‌رویم, کنار سفره هفت سین، رو به آینده‌.", "start_time": "2016-03-19T20:00:00-0700", "name": "UBCPC: 1395 Nowruz Countdown Party", "place": {"name": "Party Room, SUB, 6138 Student Union Boulevard V6T 1Z1"}, "id": "1291172010896542", "owner": {"name": "UBC Persian Club", "id": "223197857723376"}}, {"description": "Passionate about creating opportunities for other students and building community within the science population? Looking for ways to be involved with UBC Women in Science? Apply NOW for a position on the 2016-2017 UBC WiS Exec team! Deadline is EXTENDED until Sunday March 20th at 1PM! \n\nPosition openings include:\n-VP Events\n-VP External\n-VP Internal\n-VP Administration\n-Junior Executive of Mentorship\n\nFor the application form and position responsibilities, please visit: \nhttps://ubcwomeninscience.wordpress.com/2016/03/13/2016-2017-exec-elections/\n\nTHERE WILL BE FREE FOOD PROVIDED AT THE AGM!\n\n***We have also proposed some changes in our club constitution, and we would like to bring them forward to further benefit the club in future years. We need YOUR help in coming to the AGM and voting for these motions to pass! A link to the changes is also provided on the link above.", "start_time": "2016-03-21T17:30:00-0700", "end_time": "2016-03-21T19:00:00-0700", "name": "UBC WiS 2016-2017 Exec Elections + AGM!", "place": {"name": "UBC Buchanan D205"}, "id": "1587703318221020", "owner": {"name": "UBC Women In Science", "id": "623152941132776"}}, {"description": "We’ve saved the best for last!\n\nJoin us for our final Intercultural Dialogue before the Intercultural Fair. This time we’ll stepping, swinging, winin’, grooving and jiving through the world of dance!\n\nWe’ll be learning the traditional and contemporary dances from different cultures, all taught by some amazing UBC student clubs.\n\n▼►▲◄ ▼►▲◄ ▼►▲◄ ▼►▲◄ ▼►▲◄ ▼►▲◄▼►▲◄▼►▲◄\nCLUB LINEUP\n▼►▲◄ ▼►▲◄ ▼►▲◄ ▼►▲◄ ▼►▲◄ ▼►▲◄▼►▲◄▼►▲◄\n\nUBC Persian Club!\nAfrica Awareness Initiative!\n\n\nFREE Dinner will also be provided! \nDid someone say Greek-Japanese Intercultural Food Fusion??? :) \n\nPrizes to be won for bringing your ‘A’ game dance skills!\n\n▼►▲◄ ▼►▲◄ ▼►▲◄ ▼►▲◄ ▼►▲◄ ▼►▲◄▼►▲◄▼►▲◄\n\nWe acknowledge that this event and all other events at the UBC Global Lounge are taking place on unceded, traditional and ancestral territory of the hən̓q̓əmin̓əm̓ speaking xʷməθkʷəy̓əm (Musqueam) people.", "start_time": "2016-03-11T17:30:00-0800", "end_time": "2016-03-11T20:00:00-0800", "name": "Intercultural Dance Party", "place": {"name": "UBC Global Lounge", "location": {"city": "Vancouver", "country": "Canada", "latitude": 49.2618133, "longitude": -123.2552552, "state": "BC", "street": "2205 Lower Mall, Building 1", "zip": "V6T 1Z4"}, "id": "225228720977110"}, "id": "1705014759783664", "owner": {"name": "UBC Intercultural Alliance", "id": "1375713355997528"}}, {"description": "Want to change the world one mile at a time? Then come on out to the UBC Supermileage Learning Event. You can learn about our pursuit of efficiency, and how you can personally change the world just by changing the way you drive. Oh, and there will be free pizza!!\n\nDrop on by any time between 9am and 5pm. We are boothing by the UBC Bookstore on University Blvd.", "start_time": "2016-03-03T09:00:00-0800", "end_time": "2016-03-03T17:00:00-0800", "name": "UBC Supermileage Learning Event", "place": {"name": "Across from the UBC Bookstore"}, "id": "1519180375058179", "owner": {"name": "UBC Supermileage", "id": "223386944345486"}}, {"description": "Have you always been curious about the job opportunities available for the BUCS/BTM option? Looking for tips on how to kick start your first work term?\nThe Co-Op Student Association at Sauder (COSAS) is excited to present the last RealTalk series of the term, so don't miss out!\n\nRegistration for this event is now open on COOL under \"Workshops\". Light refreshments will be provided, but please be advised that it will not be a full meal.\nDress Code: Casual", "start_time": "2016-03-24T18:00:00-0700", "end_time": "2016-03-24T19:00:00-0700", "name": "BUCS/BTM Real Talk", "place": {"name": "HA 354"}, "id": "1546713582293919", "owner": {"name": "Co-op Student Association of Sauder", "id": "425123210914447"}}, {"description": "As a member of the UBC Accounting Club, you are invited to our annual general meeting (AGM) on Tuesday, March 8th!\n\nWe will be wrapping up the term with free food! We will also be voting for our next President, Vice President, and Treasurer! Come out and hear our candidates' platforms and vote for who you want to see run the club next year!\n\nWhen: Tuesday, March 8th\n\nWhere: HA 295\n\nTime: 1:00 pm - 2:00 pm\n\nCost: Free (This event is only open to members!)\n\nRSVP: UBC Accounting Club Newsletter, 6:00pm on Saturday, March 5th. \n\nThe UBC Accounting Club is currently accepting nominations for its President, Vice-President, and Treasurer positions! Learn more about these elected roles and be the face of the Club for the 2016-2017 academic year!\n\nNominations are due on Saturday, March 5th at 10 PM and voting will occur on March 8th at 1 PM. You must be a member to run for Vice-President or Treasurer and have 1 year of experience on the UBC Accounting Club executive team to run for President!\n\nJob Description & Application Form: https://drive.google.com/folderview?id=0Bw8CNqpniO9_YkRpdWZxamdtSW8&usp=sharing", "start_time": "2016-03-08T13:00:00-0800", "end_time": "2016-03-08T14:00:00-0800", "name": "UBC Accounting Club Annual General Meeting", "place": {"name": "UBC Sauder School of Business", "location": {"city": "Vancouver", "country": "Canada", "latitude": 49.2654365, "longitude": -123.2537487, "state": "BC", "street": "2053 Main Mall (Henry Angus)", "zip": "V6T 1Z2"}, "id": "152000511496023"}, "id": "258703511128435", "owner": {"name": "UBC Accounting Club", "id": "192153777518213"}}, {"description": "The African Business Club presents its second social event this semester! Hosted by the Geopolitics and Finance Directors, this event aims to amalgamate issues concerning boarder security in western Africa and African business success stories. \n\nIf you’re looking for a relaxed ease into a hectic week ahead, break from a long Monday or just a genuinely intriguing discussion and good company, this is the event for you! During the evening you’ll have the opportunity to watch specific handpicked videos, participate in thought-provoking discussions and engage first-hand with current issues of extreme global importance. Snacks and refreshments will also be available!\n\nLet us entertain you on Monday evening! Looking forward to seeing you at the Global Lounge. \n\n\nTheme: Engaging with current geopolitical and financial issues in Africa. \n\nTwo topics: \n\t•\tThe issue of security in west Africa and its affect on cross-border relations\n\t•\tAfrican success stories and the role of financing \n\nLocation:\t\t Global Lounge \nDate: \t\tMonday, 7 March \nTime: \t\t\t6pm \n\nAND FREE FOOD!!! :D\n\f", "start_time": "2016-03-07T18:00:00-0800", "end_time": "2016-03-07T20:30:00-0800", "name": "The African paradigm: Security issues and Success stories", "place": {"name": "UBC Global Lounge", "location": {"city": "Vancouver", "country": "Canada", "latitude": 49.2618133, "longitude": -123.2552552, "state": "BC", "street": "2205 Lower Mall, Building 1", "zip": "V6T 1Z4"}, "id": "225228720977110"}, "id": "1683507701906737", "owner": {"name": "UBC African Business Club", "id": "140962286236583"}}, {"description": "The inaugural EUS Spring Conference will be day long conference will feature workshops on professional development, diversity in engineering and volunteer training to UBC Engineering Students! These workshops will be facilitated by UBC Engineering Students. Many of these students represented UBC Engineering at various conferences throughout this past year. This conference is a chance for members of the EUS, department clubs, ex-officio clubs, and students-at-large to connect and share their experiences.\n\nThe conference will take place on March 19th from 9am-4:30pm in the Engineering Student Centre with workshops in Kaiser and CEME.\n\nIf you would like to volunteer, sign up here https://docs.google.com/forms/d/1vAPPSSw4c9g7_EjYn7O-XyFwgf2136eXGHhwcCcHInA/viewform\n\nRegistration is free and includes a free lunch! Learn more at: ubcengineers.ca/springconference", "start_time": "2016-03-19T09:00:00-0700", "end_time": "2016-03-19T16:30:00-0700", "name": "EUS Spring Conference", "place": {"name": "UBC Engineering Undergraduate Society", "location": {"city": "Vancouver", "country": "Canada", "latitude": 49.2613792, "longitude": -123.2485809, "state": "BC", "street": "2335 Engineering Road", "zip": "V6T1Z4"}, "id": "171391373016630"}, "id": "511505335689186", "owner": {"name": "UBC Engineering Undergraduate Society", "id": "171391373016630"}}, {"description": "The Eating Sustainably  will showcase, educate and encourage students to support local food products that tie in the idea of sustainability. \n\nThe Sustainability Ambassadors will host a hot-lunch provided by the finest UBC catering services (Westcadia, AMS Food Services, Agora and Sprouts) and other food products from a wide range of sponsors. The lunch will use ingredients that are grown or raised in an ecologically and ethically responsible manner, using practices that protect the environment, safeguard human health, ensure humane treatment of farm animals and provide fair treatment to workers. Funds raised from this event will be donated to the AMS food bank.\n\nCost: $2 (all proceeds will be donated the AMS Food Bank).\n\nEnjoy an entrée, main course and desert at this interactive event where attendees will have to interact with at least one to two booths in order to obtain their food course!\n\nPhoto Credit: Martin Dee / UBC Communications & Marketing", "start_time": "2016-03-23T11:00:00-0700", "end_time": "2016-03-23T14:00:00-0700", "name": "Eating Sustainably for Wellbeing", "place": {"name": "AMS Student Nest", "location": {"city": "Vancouver", "country": "Canada", "latitude": 49.266485668, "longitude": -123.24990050775, "state": "BC", "street": "6133 University Boulevard", "zip": "V6T 1Z1"}, "id": "1650598338487394"}, "id": "949097218492330", "owner": {"name": "UBC Sustainability", "id": "110119109055867"}}, {"description": "Are you currently looking for a co-op work placement? Are you nervous about looking for your first work placement? \nAre you looking to polish your interview skills for a challenging interview?\nAre you looking forward to having experienced co-op students give you advice on your cover letter or resume? \n\nScience Co-op Students Associations (SCOOPS) will be hosting a three-in-one package to help you! We will offer one on one resume, cover letter and mock interview workshops for all those currently applying for science co-op jobs or are interested.\n\nWe will have SPECIFIC industry/job targeted questions to help you bring on your A game to the real interview. \n\n**Refreshments will be provided. Availability is on first come first serve basis. **\n\nDRESS CODE: Business casual\nFREE membership at event!\n\nTo get the most out of this workshop, please RSVP by using the link below and indicate what kind of job you are interested in, it will help our facilitators a long way to better prepare for a personalized workshop!\n\nLink: https://docs.google.com/forms/d/1pyUO13jY8p_YIulf5Ot43_G0THINSnf3zgsGhJWTf-w/viewform?c=0&w=1&usp=mail_form_link\n\nLooking forward to seeing you soon!", "start_time": "2016-03-17T17:30:00-0700", "name": "UBC SCOOPS 3-In-1 Workshop: Resume, CL Review + MOCK Interviews", "place": {"name": "OLD SUB Room 206 (Council Chambers)"}, "id": "195087024188105", "owner": {"name": "UBC Science Co-op Students Association", "id": "126302794138107"}}, {"description": "National Co-op Week falls on March 14 to 18 this year and SCOOPS planned so many events to celebrate!\n\nLove FREE FOOD? Come check out our booth on March 15 in the Nest! We will be having carnival games and Cards Against Humanity-Interview Style! Prizes will be given! Also, we can answer any burning questions you have about life in Co-op from students who have first hand experience! FREE membership available!\n\nMaybe you are adventurous! SCOOPS is sponsoring 2 team for Storm the Wall this year! Whether you don't have any athletic friends or you just wanna chill with us cool folks, you can register for FREE with SCOOPS! Signups are on a FIRST COME FIRST SERVE basis. PM us on Facebook to signup. https://www.facebook.com/UBCSCOOPS/\n\nStill looking for a work placement? Science Co-op Students Association (SCOOPS) will be hosting a second cover letter/resume peer review and mock interview workshop on Thursday, Mar. 17th, from 5:30-7:00PM location TBA.\n\nParticipants can expect a mock interview targeted to a relevant field of interest, from clinical research to an industry job. We will also have experienced Co-op student mentors available to give you one-on-one peer review on your resumes/cover letters. Refreshments will be provided! FREE membership at signup!\n\n Don't forget to RSVP to our Facebook event page!\nhttps://www.facebook.com/events/195087024188105/", "start_time": "2016-03-15T11:00:00-0700", "end_time": "2016-03-15T15:00:00-0700", "name": "NATIONAL COOP WEEK", "place": {"name": "Abdul Ladha Science Student Centre", "location": {"city": "Vancouver", "country": "Canada", "latitude": 49.2661219, "longitude": -123.2510003, "state": "BC", "street": "2055 East Mall", "zip": "V6T 1W5"}, "id": "152819448084339"}, "id": "658486260958635", "owner": {"name": "UBC Science Co-op Students Association", "id": "126302794138107"}}, {"description": "All students who vote will receive FREE BURGER at the Civil Club BBQ on March 18 at 11:00 am at the EDC Courtyard. Students must vote prior to getting free food. Voting is for the new Civil Club Executive and Professors of the Year!\n\nStudents on co-op don't need to worry as there will be online ballots avaliable which will be e-mailed. Civil merchandise will also be available for purchase during the event. We have shirts, toques, patches, stickers, sun glasses and pins!\n- - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - \n\nWant to get involved in the UBC Civil Engineering Club? Now is your chance! The Civil Club is looking for enthusiastic students who want to make a positive change in their community! Civil Club Elections 2016 are held in March with voting on March 18 when all civil undergrads vote to elect 6 executives and 9 ex-officio positions.\n\n\n*Nominations Open - Friday, March 4 at 11:59 PM\n*Nominations Close - Friday, March 11 at 4:00 PM\n*Candidates Meetings (Optional) - March 11 - 4:00 PM\n*Campaigning Starts - Friday, March 12 at 12:01 AM\n*Voting Starts - Friday March 18 12:01 AM \n*Voting & Campaigning Close - Friday March 18 12:59 PM\n\nNomination forms will be made avaliable online when nominations open. Available positions are listed below with a brief description. Still got questions? Ask any of the current executives! You can also check out our website (http://ubccec.com/) or send the presidents an email at president@ubccec.com.\n\n- - - - - - - - - - - - - - - - - - - - - - - \nEXECUTIVE POSITIONS:\n\n**PRESIDENT**\nThe President is in charge of overseeing all club activities. They are in charge of being the liaison between the civil student body and the Engineering Undergraduate Society (EUS) and Civil Engineering Department.\n\n**VICE-PRESIDENT**\nThe Vice President operates as second-in-command to the President. They are responsible for overseeing club activities and providing additional support to the President as needed.\n\n**TREASURER**\nThe Club Treasurer is responsible for planning and preparing an annual budget for the club, as well as handling finances over the course of the year.\n\n**SOCIAL COORDINATOR**\nThe Social Coordinator is responsible for leading the club's social events, with the goal of increasing interactions amongst civil students, students of other departments, and faculty members.\n\n**SECRETARY**\nThe Secretary is responsible for taking and distributing meeting minutes from the weekly Civil Club meetings.\n\n**PUBLICITY REPRESENTATIVE**\nThe Publicity Rep in charge of social media and publicity for all civil club events. Primary responsibilities include managing the facebook page, creating and distributing posters, and making class announcements. \n\n- - - - - - - - - - - - - - - - - - - - - - - \nEX-OFFICIO POSITIONS:\n\n**ACADEMIC REPRESENTATIVE**\nThe Academic Rep is responsible for coordinating additional exam preparation tutorial sessions and communicating all students' academic concerns to the department.\n\n**THIRD YEAR REPRESENTATIVE**\nResponsible for conveying information between the 3rd Year class and the Civil Club. They share club updates with their class, and their class' questions, feelings, and suggestions with the club.\n\n**GRAD REPRESENTATIVE(S)**\nThe Grad Rep(s) are responsible for conveying information between the 4th Year class and the Civil Club. They are also in charge of fundraising for grad events, play a role in planning the Iron Ring ceremony, dinner, and after-party at the end of the year, and organize the annual Grad Trip.\n\n**SPORTS REPRESENTATIVE**\nThe Sports Rep is responsible for coordinating civil sports teams, including intramural and EUS-event sports teams.\n\n**E-WEEK REPRESENTATIVE**\nThe E-Week Rep is responsible for overseeing civil involvement in all E-Week events, including promoting events to civil students, attending EUS-hosted E-Week prep meetings, coordinating participation and team involvement, and overseeing event attendence. E-Week preparations begin the first week of January, and E-Week is held in the first full week of February.\n\n**DESIGN STUDIO & LOFT MANAGER**\nThe Design Studio and Loft Manager is in charge of taking care of the Design Studio and the Loft. They work for the general betterment of both spaces, including replacing, re-stocking, and managing services like the Design Studio printer and the Loft's vending machines.\n\n**UNDERGROUND EDITOR**\nThe Underground Editor is in charge of creating and distributing our monthly department newsletter, the Civil Underground, which contains news, faculty and club updates, and details about upcoming events.\n\n**WEBMASTER**\nThe Webmaster is in charge of updating and maintaining the club website.\n\n**MERCHANDISE REPRESENTATIVE**\nThe Merchandise Rep is in charge of the ordering, marketing and sales of club paraphernalia, including jackets, hats, patches, pins and t-shirts.", "start_time": "2016-03-18T11:00:00-0700", "end_time": "2016-03-18T13:00:00-0700", "name": "Civil Club Elections & BBQ 2016", "place": {"name": "EDC Courtyard"}, "id": "1559409817706240", "owner": {"name": "UBC Civil Club", "id": "127516137761"}}], "key": "March"}, {"data": [{"description": "You are cordially invited to join us on April 1, 2016 for an exciting evening of Art Historical discussion and critical reflection. The symposium comprises the presentation and discussion of a range of undergraduate research treating on contemporary and historical issues. This year's topics examine various art historical discourses, including: the amplification of brand value through imaging; the exploration of technophobia and transphobia assisted by advances in biotechnology, through the lens of the “The Cyborg Manifesto;” and, finally, the expression of national identity through the principle of “one in the all (wanwu guiyi)” that is firmly associated with history, society and Chinese culture. Each presentation will be followed by a conversation period during which all students and faculty are encouraged to voice questions and comments. Refreshments will be provided during intermission and final reception.\n \nThe Undergraduate Journal of Art History and Visual Culture (UJAH) will launch their 7th issue at the symposium. This publication features the exceptional body of research, art, and writing taking place in all undergraduate art disciplines at UBC, as well as the abstracts of this year’s symposium papers.\n \n3:00PM – Introduction\n \nBlake Finucane, #Branded: Christie’s in the Age of Digital Image Circulation\n \nRan Zheng, To Move The Mountain: The Image Of Collectivity In Chinese Contemporary Art\n \n4:00-4:10PM – Intermission\n \nLucas Kling, The Cyborg Complex: Technophobia, Transphobia, and American Reflexxx \n \n5:00PM – Reception \n \nUBC Art History Students’ Association\nEmail: ubcahsa@gmail.com\nFacebook: Facebook.com/UBCAHSA\nwww.ahva.ubc.ca", "start_time": "2016-04-01T15:00:00-0700", "end_time": "2016-04-01T18:30:00-0700", "name": "12th Annual Art History Undergraduate Symposium & UJAH Issue 7 Launch", "place": {"name": "Audain Art Centre", "location": {"city": "Vancouver", "country": "Canada", "latitude": 49.2638682, "longitude": -123.2547265, "state": "BC", "street": "6398 University Avenue"}, "id": "1405143836412956"}, "id": "1705623736372198", "owner": {"name": "UBC Art History, Visual Art and Theory", "id": "111982666071"}}, {"description": "Ever had a conversation that sounded like this?\n\n“ Alpha: Dude you look tired.\n. Beta: I’ve been mugging for days ”\n \nFeeling like a dazed Beta?  No fear, SSA is here! Put on your most comfortable clothes (promise we won’t judge) and join us on Mondays & Wednesdays for some serious knowledge gains. Take regular study breaks with us to destress; detox but don’t degenerate! We’ll help you keep those motivation levels up with FREE FOOD AND DRINKS, friends and fun! Jk please study.\n\n\nNew team, New name, Same study feels. SSA is back and ready to mug! See you there!\n\nSTUDY DATES & TIMES\nDate: April 11th, 13th, 18th, 20th\nVenue: HA 343 (Sauder building)\nTime: 9AM - 10PM\n\n*UPDATE*\nHA 343 is also available on the following days. Feel free to use it for studying; please note, however, that snacks will not be provided on these dates.\n\nDate: April 15th/22nd/17th/24th \nVenue: HA 343  (Sauder building)\nTime:  9AM -10PM", "start_time": "2016-04-11T10:00:00-0700", "end_time": "2016-04-11T22:00:00-0700", "name": "SSA Finals Fuhhdaze", "place": {"name": "HA 343 (Sauder building)"}, "id": "1702811683326903", "owner": {"name": "UBC Singapore Students' Association", "id": "880262285394994"}}, {"description": "UBC Club Mech would like to invite you to our Networking 101 Workshop. This is a free event for all UBC Engineering students. \n\nDate: Thursday, March 31st 2016 \nTime: 6pm-8:30pm (sign in at 5:30)\nLocation: Engineering Student Centre (ESC) \nMax. Capacity: 200 \nFood & beverages provided\n\nWe will be graced by the president of Vancouver’s Social Butterfly Club, Alice Zhou,  who will be giving a 2-hour presentation and interactive workshop on networking. Alice is an established event producer and publicist in Vancouver with over 6000 professional contacts in her network and is known as Vancouver's Networking Queen. \n\nAlice’s interactive workshop will cover the following networking topics:\n How to prepare before networking\n What to do during a networking event\n Tools of the trade\n When and how to best follow up with a networking contact\n Who should you network with?\n How to turn networking into getting a job or promotion\n\nBring/prepare a business card design (can be paper-printed design or an actual card), have a set-up LinkedIn profile, and dress in business casual/formal attire – as if you are actually attending a real networking event. \n\nRSVP HERE: http://goo.gl/forms/z6PCWSvvoQ \nRSVP LATEST BY WEDNESDAY, MARCH 30!\n\nWe hope to see you there!", "start_time": "2016-03-31T18:00:00-0700", "end_time": "2016-03-31T21:00:00-0700", "name": "Networking 101 Workshop", "place": {"name": "UBC Engineering Student Centre", "location": {"city": "Vancouver", "country": "Canada", "latitude": 49.2538414, "longitude": -123.2348099, "state": "BC", "street": "2335 Engineering Lane", "zip": "V6T1Z4"}, "id": "186387364719842"}, "id": "1654283971490585", "owner": {"name": "UBC Club Mech", "id": "100699010041708"}}, {"description": "Feeling lAUSt in Arts? Not sure what you're going to do with your BA? \nFear no more! Let AUS be your compass! \n\nAUS FYC is excited to present \"Beyond the BA\", a career conference that will guide you, as a first year student, to your future. Bringing in Alumni from all major faculties, BtBA will take you on a journey of all the post BA possibilities.\nBtBA hopes to inspire first years by presenting them with the opportunity to see how life is beyond the BA. Alumni from all ages will be speaking on their lives and jobs, and the opportunities that their UBC degree has given them post-graduation. This wide range of speakers will provide you with a timeline of how a Bachelors of Arts can assist you. \n\n---------------\n\nFor no cost at all, this conference will include:\n- Complimentary lunch from Scent of a Sandwich \n- Refreshments\n- Amazing networking opportunities!\n\n---------------\n\nREGISTER NOW FOR FREE! We have a limited amount of spots, so hop on them quick! Sign up here:\nhttp://goo.gl/forms/zGShvfcJO9\n---------------\nDress code: Business casual.\n--------------\n10:30 AM Registration \n-----------------\n11:00 AM Opening Ceremony | Keynote\n11:45 AM Session 1\n12:15 PM Session 2 \n-----------------\n12:45 PM Lunch\n-----------------\n1:45 PM Session 3 \n2:20 PM Session 4 \n2:50 PM Keynotes | Closing Ceremony \n----------------\n3:30 PM End\n-------------------------------------------------------------------------------------\n\n\n#getlAUSt #BeFound\n#12000strong #thisisyourhAUS", "start_time": "2016-04-02T10:30:00-0700", "end_time": "2016-04-02T15:35:00-0700", "name": "The AUS FYC Presents: Beyond the BA Conference", "place": {"name": "Buchanan A", "location": {"city": "Vancouver", "country": "Canada", "latitude": 49.268391936931, "located_in": "16761458703", "longitude": -123.25481385686, "state": "BC", "street": "1866 Main Mall", "zip": "V6T 1Z1"}, "id": "152668228098860"}, "id": "716563411814137", "owner": {"name": "UBC Arts Undergraduate Society", "id": "107744622618307"}}, {"description": "The ECESS is hosting its final Games Night of the semester! \nTake a break from studying and project work, grab your friends and come join us! \n\nThere will be, as usual, FREE PIZZA, GAMES & AWESOME PRIZES!\n\nThink you've got mad skills at FIFA, Foosball, NHL, Pool, or Smash Bros.? Put them to the test and enter our tournaments. Not a fan of competition? Don't worry, we have other games to play. \n\n★TOURNAMENTS!★\n\nPool:\n           Sign Up Here:  http://goo.gl/forms/bcKTirTXFW\n\nNHL:\n           Sign Up Here:  http://goo.gl/forms/fK3Ep1l3is\n\nFIFA:\n           Sign Up Here:  http://goo.gl/forms/yviQitqBbS\n\nSmash Bros. Melee\n           Sign Up Here:  http://goo.gl/forms/hxJMAOQSWV\n\nFoosball:\n           Sign Up Here:  http://goo.gl/forms/2JZaWsr6VT\n\n★VIDEO GAMES★\n\nStreet Fighter V\nHalo\nMario Kart \nMario Party\n\n★BOARD GAMES★\n\nResistance\nCoup\nSkull\nSaboteur\nBetrayal at House on the Hill\nand More\n\n★CARD GAMES★\n\nPoker\nBlackjack\nSpoons (or Knives if you prefer)\nand More", "start_time": "2016-04-01T17:00:00-0700", "end_time": "2016-04-01T21:00:00-0700", "name": "ECESS Games Night", "place": {"name": "MCLD 434"}, "id": "177483775972056", "owner": {"name": "UBC Electrical & Computer Engineering Student Society (ECESS)", "id": "359994484090375"}}, {"description": "The African Business Club presents its third social event this semester! Hosted by the Infrastructure and Entrepreneurship Directors, this event’s objective is to spark discussion around Africa’s opportunity to leapfrog in diverse technological and entrepreneurial avenues: with innovations ranging from widespread mobile connectivity and clean energy to technology-enabled healthcare and education systems. The event will start with a TEDx talk by Mark Essien (Nigerian tech entrepreneur), which will serve as a foundation for discussion and debate.\n\nThis is a free event and a great chance to relax after a long  Monday with friends and some great company from the African Business Club team! If you are looking to have a great time with food, good company and an engaging discussion on topics of global importance, this event is for you!\n\n Let us entertain you on Monday evening! Looking forward to seeing you at the Global Lounge. \n\nSome of the topics to be discussed are founded on these questions : \n\nThe West has thrived on the development of transformative technology, some of which have become older legacy systems: Should Africa bypass those legacy systems and instead use current technology and innovative techniques to leapfrog the West?\nShould Africans take the lead on renewable energy? Why? Why not?\n\n Snacks and refreshments will also be available!\n\nThis event is free and open to everyone and also, \nFREE FOOD!", "start_time": "2016-04-04T18:00:00-0700", "end_time": "2016-04-04T20:00:00-0700", "name": "Reimagining Innovation in Africa: Leapfrogging the Rest of the World", "place": {"name": "UBC Global Lounge", "location": {"city": "Vancouver", "country": "Canada", "latitude": 49.2618133, "longitude": -123.2552552, "state": "BC", "street": "2205 Lower Mall, Building 1", "zip": "V6T 1Z4"}, "id": "225228720977110"}, "id": "1724433361177218", "owner": {"name": "UBC African Business Club", "id": "140962286236583"}}, {"description": "The very AMS that built the AMS Student Nest and hosts The 9th Annual AMS Block Party is hosting an open house to get you consulted, employed and on the winning end of some free block party tickets and/or gift cards! \n********************************************************************\n1) TELL US WHAT YOU THINK \nIn person - We're throwing our doors open for a literal open house this and welcoming students into the Nest for some focus groups on what to do with the former Perch space. Come by either session and be entered in a raffle to win two block party tickets! \n\nOpen house dates/times: Saturday April 2nd from 3:45-5:30PM and Thursday April 7th from 11AM-3PM \n\nOnline Survey - fill it out and win free things (~link coming at you real soon, check back tomorrow for more~)\n********************************************************************\n2) GET EMPLOYED\nhttp://www.ams.ubc.ca/jobs/employment/ \nWe're hiring for next year and all the jobs are posted at the link above - make sure you click the \"more job descriptions\" button to see all the options. Perks include year long pit guest list and lots of free coffee....", "start_time": "2016-04-02T12:00:00-0700", "end_time": "2016-04-08T12:00:00-0700", "name": "AMS Open House & Hiring", "place": {"name": "UBC Alma Mater Society - AMS", "location": {"city": "Vancouver", "country": "Canada", "latitude": 49.2686112, "longitude": -123.2503152, "state": "BC", "street": "AMS of UBC Vancouver 6133 University Boulevard", "zip": "V6T 1Z1"}, "id": "48978787993"}, "id": "1857250177835314", "owner": {"name": "UBC Alma Mater Society - AMS", "id": "48978787993"}}, {"description": "Do YOU like swimming? \nWant to meet some great people and get fit along the way?\n\nCome out to the Inaugral 2016 UBC Swim Club Kick Off Event for more info! There will be information on our programs, free food, a post info social at the Pit, and a draw prize for a free 2016/2017 membership!\n\nCheck out our page for more info on our club and give it a good ol thumbs up!\nhttps://www.facebook.com/swimclub.ubc/\n\nCan't wait to see you there!\n\n~UBC Swim Club Execs", "start_time": "2016-03-31T19:00:00-0700", "name": "UBC Swim Club Kick Off Night + Pit", "place": {"name": "Lev Bukhman Theatre Lounge (egg)"}, "id": "980722488687138", "owner": {"name": "AMS Swim Club at UBC", "id": "349037658553684"}}], "key": "April"}]
